{"id":326,"full_description":"Summer Internship: Software Developer **Job Title:** Summer Software Developer Internship**Company:** Differnt Systems (Formerly F&S Digital)**Location:** New Jersey (HQ in Ventnor City)**About Differnt:**Differnt Systems is a forward-thinking technology consulting, development, and implementation firm with a strong presence in New Jersey. We are dedicated to pioneering advancements in technology, leveraging tangible innovations like robotics and building automation, alongside digital innovations in software development and secure cloud infrastructure. Our mission is to ensure that our clients remain at the forefront of technology, catering to both tech-savvy and non-technical clients.**Internship Overview:**As a Summer Software Developer Intern at Differnt Systems, you will have the opportunity to work on a variety of internal and external-facing client projects. You will collaborate with our team of experienced professionals and gain hands-on experience in software development, Agile methodologies, and cutting-edge technologies.**Internship Preferences:*** Familiarity with Git and Agile Development practices.* Proficiency in JavaScript or Swift (preferred).* Completion of a Data Structures & Algorithms course.**Internship Requirements:*** Strong teamwork and collaboration skills.* Excellent time-management skills.* Effective interpersonal and communication skills.**Key Responsibilities:*** Work as an integral part of a development team, utilizing Agile development techniques to create applications and services.* Contribute to team and organizational infrastructure and process improvements.* Develop front-facing user interfaces and back-end services.* Gain an understanding of internal CI\/CD (Continuous Integration\/Continuous Deployment) processes.* Utilize tools and problem-solving skills to identify and resolve defects before they impact the project.* Collaborate with designers to implement application elements.**Benefits:*** Flexible work schedule.* Provided Apple equipment for your work.* Opportunity to work alongside a close-knit and experienced team of professionals.* Perfect environment to experiment and expand your skills in a real-world setting.Job Types: Part-time, Temporary, InternshipPay: $20.00 per hourExpected hours: 15 – 20 per weekBenefits:* Flexible scheduleSchedule:* Monday to Friday* Weekends as neededApplication Question(s):* Do any of the following apply to you?* Current NJ undergraduate student* Current NJ Graduate student* Recent NJ College Graduate: Graduated less than one year ago (May 2023-May 2024)Ability to Commute:* Ventnor City, NJ 08406 (Preferred)Willingness to travel:* 25% (Preferred)Work Location: Hybrid remote in Ventnor City, NJ 08406"}
{"id":398,"full_description":"Junior DevOps Engineer The mission of Thayer Leadership is to help build leaders of character by offering leadership and ethics education grounded in the United States Army leadership philosophy of “Be, Know, Do” and the United States Military Academy values of “Duty, Honor, Country,” in the inspirational venue of The Historic Thayer Hotel at West Point. In addition to our in-person offerings, due to COVID-19, we pivoted to deliver our powerful leadership experiences digitally through various platforms in order to continue to bring our clients the West Point experience from their respective locations. We are now delivering both in-person and virtual\/online programs.Diversity and Inclusion is important to Thayer Leadership. Our goal is to ensure the entire Thayer family (staff, partners, faculty, and clients) feel respected by embracing a culture of trust and inclusivity that acknowledges and celebrates our differences and commonalities.**Job Purpose**As a Junior Devops Engineer at Thayer Leadership, youll be an integral part of our dynamic team. Youll collaborate with our IT department to improve communication and cross-functional project management within the entire organization. As a junior engineer, you will assist in scripting software for deployment throughout our data and communication platforms, manage cloud environments, implement automation solutions, and optimize business processes. If youre passionate about technology, eager to learn, and ready to make an impact, we encourage you to apply!**Duties of Role:**Responsibilities shall include:Azure Administration:* Assist in managing Azure subscriptions, virtual machines, storage, and networking components.* Monitor performance, troubleshoot issues, and ensure optimal resource utilization.Cloud Management:* Work closely with cross-functional teams to design, deploy, and maintain cloud-based solutions.* Implement security best practices and ensure compliance with industry standards.Automation:* Develop and maintain scripts for automating routine tasks using PowerShell, Python, or other scripting languages.* Create and manage Azure Logic Apps, Azure Functions, and other automation workflows.Coding:* Write clean, efficient, and well-documented code* Collaborate to integrate custom applications with cloud services.SharePoint:* Assist in SharePoint site administration, permissions management, and content organization.* Troubleshoot SharePoint-related issues and provide end-user support.Airtable Automations:* Design and implement workflows in Airtable to streamline data management and reporting.* Integrate Airtable with other tools and platforms as needed.Development & Operations Engineering:* Development and monitoring of web-based applications, integrating automated processes and testing configurations and system controls.* Quality assurance and maintenance, including supporting access control, vulnerability management, and system security* Planning and project management, including working on ways to automate and improve processes**Skills and Qualifications*** Strong interest in cloud technologies, especially Microsoft Azure.* Basic understanding of programming concepts and willingness to learn coding languages (i.e., Python, Bash).* Familiarity with SharePoint and Airtable is a plus.* Excellent problem-solving skills, analytical skills and a proactive attitude.* Strong communication and teamwork abilities* Strong communication and teamwork abilities* Minimum 3 years of applicable job experience.**Education*** Bachelors degree in Computer Science, Information Technology, or related field (or equivalent experience)Job Type: Full-timePay: $60,000.00 - $80,000.00 per yearBenefits:* 401(k)* Dental insurance* Health insurance* Paid time off* Vision insuranceExperience level:* 3 yearsSchedule:* 8 hour shift* Day shift* Monday to FridayExperience:* Information Technology: 3 years (Required)* Windows: 3 years (Required)Ability to Relocate:* West Point, NY 10996: Relocate before starting work (Required)Work Location: In person"}
{"id":383,"full_description":"Salesforce Developer with MuleSoft Experience (REMOTE) Everlight Solar is seeking a skilled Salesforce Developer who will design and code functional programs and applications, producing fully functional software applications according to requirements. As a Salesforce Developer, you play a key role in serving our clients and team members. This will be a full-time, work-from-home \"remote\" position.**Must own a Mac computer and be fluent with the Apple ecosystem of software (iOS, macOS, iWork, etc.)**Everlight Solar is a rapidly growing company and the leader of solar energy in the Midwest. We offer a unique experience that fosters individual growth and rewards performance. Our culture at Everlight is extremely important to us. The work environment is fast-paced and dynamic. We value teamwork, quality, innovation, and customer success. Our ideal candidate is self-motivated, detail-oriented, has excellent problem-solving abilities, is passionate about delivering results on-time, exceeding expectations, and ensuring success for our teams.**Responsibilities:*** Ensure consistent alignment of Sales and Marketing to optimize the sales process with a focus on improving and evolving a qualified lead process, distribution, and management.* Provide Sales and Marketing with accurate reporting on the organization's key performance indicators on a consistent basis including actionable steps to improve the experience delivered to current and future customers* Demonstrated ability to meet deadlines, handle and prioritize simultaneous requests, and manage laterally and upwards* Creative and analytical thinker with strong problem-solving skills* Ability to critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs* Ability to assess the impact of new requirements on Salesforce.com and all upstream and downstream applications, systems and processes**Requirements:*** Minimum two years of experience as a Salesforce.com Developer* Salesforce.com Certified Platform Developer 1 certification required* Salesforce.com Certified Platform Developer 2 certification preferred* Minimum two years of experience as a Mulesoft Developer* MuleSoft Developer Certification - Level 1 Certification Required* MuleSoft Developer Certification - Level 1 Certification Preferred* MuleSoft Certified Integration Architect - Level 1 certification Preferred* Experience building REST and SOAP-based APIs using Mule ESB flows with API-led connectivity architecture.* Proven ability to design and implement new processes and facilitate user adoption.* Strong understanding of the platform, with the ability to build custom apps and objects, formula fields, workflows, custom views, Apex classes and other content of advanced complexity* Strong understanding of Salesforce.com best practices and functionality* Strong data management abilities* A documented history of successfully driving projects to completion* A demonstrated ability to understand and articulate complex requirements* Excellent project management skills and a positive attitude* Must demonstrate exceptional verbal and written communication skills* Must demonstrate ability to communicate effectively at all levels of the organization**Benefits:**  * Health Insurance* Dental Insurance* Vision Insurance* Life Insurance* PTO* Sick and Safe Time* Paid Holidays Off**Salary: $95,000-100,000\/ year***Everlight Solar is proudly an Equal Opportunity Employer. We value diversity of all types and are excited to work with talented individuals from a wide range of backgrounds. Everlight is committed to inclusion and we invite people of any race, creed, color, national origin, ancestry, marital status, sexual orientation, gender identity or expression, disability, nationality or sex, age groups (18+), and levels of education to apply. Authorized to work in the US and background check required.*"}
{"id":553,"full_description":"Website Developer **About us**We are professional, agile and professional.Our work environment includes:* Modern office setting* Food provided* Work-from-home daysBurt's Wireless Inc., the Southern Tier's premier independently owned and operated MNVO, is currently seeking a talented and dedicated **Website Developer** to join our dynamic team. We're not just another wireless provider; we're a force for positive change in our community. Every month, a portion of our company's profit is used to support local charities. By joining us, you're not just taking a job; you're becoming part of a movement that believes in the incredible power of giving back.Responsibilities:* Collaborate with our team to design, develop, and manage our website and web interfaces.* Develop and optimize both front-end and back-end website elements.* Ensure our website is optimized for mobile and desktop performance.* Conduct regular website testing and debugging.* Maintain a high level of knowledge and expertise in the latest web development industry trends and advancements.Requirements:* Proven experience as a website developer.* Proficient in HTML\/CSS, JavaScript, and other relevant web design coding languages.* Experience with responsive and adaptive design.* Strong problem-solving abilities.* Excellent communication skills and attention to detail.Preferred Qualifications:* Experience with SEO best practices.* Familiarity with content management systems.* Bachelor's degree in computer science or related field.Become a part of our mission to make a difference simply by using your everyday devices. We believe in going beyond the ordinary, and we are looking for candidates who share this passion. If this sounds like you, we would love to hear from you.Remember, at Burt's Wireless Inc., it's not just about what you do; it's about making a difference in the community we serve. Apply now to become a part of this incredible journey!Job Type: ContractPay: $25.27 - $28.06 per hourExpected hours: 35 per weekBenefits:* Dental insurance* Health insurance* Paid time offSchedule:* Monday to FridaySupplemental pay types:* Bonus opportunities* Commission pay* Signing bonus* TipsExperience:* WordPress: 7 years (Required)Work Location: Remote"}
{"id":173,"full_description":"Sr Software Engineer (Front End Developer) **Disney Entertainment & ESPN Technology**On any given day at Disney Entertainment & ESPN Technology, were reimagining ways to create magical viewing experiences for the worlds most beloved stories while also transforming Disneys media business for the future. Whether thats evolving our streaming and digital products in new and immersive ways, powering worldwide advertising and distribution to maximize flexibility and efficiency, or delivering Disneys unmatched entertainment and sports content, every day is a moment to make a difference to partners and to hundreds of millions of people around the world.*A few reasons why we think youd love working for Disney Entertainment & ESPN Technology** **Building the future of Disneys media business:** DE&E Technologists are designing and building the infrastructure that will power Disneys media, advertising, and distribution businesses for years to come.* **Reach & Scale:** The products and platforms this group builds and operates delight millions of consumers every minute of every day – from Disney+ and Hulu, to ABC News and Entertainment, to ESPN and ESPN+, and much more.* **Innovation:** We develop and execute groundbreaking products and techniques that shape industry norms and enhance how audiences experience sports, entertainment & news.As part of the Living Room Devices, Browser Based Device, Client Application Engineering Team, you will help us push the boundaries of what is possible on some of the most interesting 10-foot devices and TVs in the marketplace! Youll be part of the team that builds our Direct-to-Consumer client apps, such as Disney+, Star+, ESPN and Hulu on a wide range of devices that run on browser and JavaScript technologies.**Job Summary:**Were seeking a Senior Software Engineer who will be an outstanding addition to our JavaScript browser-based devices team. The right person for this role is highly motivated, collaborative, and technical, with the ability to coordinate across teams and empower both themselves and others in striving for and achieving excellence. Everything we do directly affects millions of global consumers, their experience with our service, and impacts our business.**Responsibilities and Duties of the Role:*** Rapidly prototype and implement scalable, reliable, and maintainable media applications using TypeScript, JavaScript, and other web development technologies.* Work closely with UX designers, product managers, and engineering leadership to build best-of-class, delightful streaming experiences.* Collaborate with other developers to build, review, and deliver modern media applications to Samsung, LG, and other streaming-media devices.* Use data and experimentation to reinforce the value of new product functionality, ensure that we are providing the best experience possible for our viewers, and continuously improve our applications.* Provide mentorship to junior software engineers.**Required Education, Experience\/Skills\/Training:**Basic Qualifications* 5+ years of experience in front-end application development with proficiency in writing optimized JavaScript (ES5 &ES6) and TypeScript with a low memory footprint.* Leadership, the ability to identify problems and drive towards solutions, and an eagerness to learn and teach new technologies & solve novel problems.* Experience building browser-based applications using TypeScript, JavaScript, Preact\/React and Redux.* A deep understanding of computer science fundamentals (data structures, algorithms, etc.).* Experience developing sophisticated user interfaces in a large and organized codebase.* Work samples demonstrating experience in building great user interfaces.Preferred Qualifications* Experience with our common development tools such as: GitHub, Jenkins, Webpack, AWS, Confluence, JIRA.* Experience building applications backed by web-services is a plus.* Experience developing for Samsung, LG, or similar devices is also a plus.* Launched or worked on an international product.* Strong experience with Scrum methodology.Required EducationBachelors degree or better in Computer Science or a related technical field or equivalent job experience.  The hiring range for this position in Seattle, WA and in New York City, NY is $142,516- $191,180 per year; the hiring range for this position in Santa Monica\/Burbank\/Glendale\/L.A., California and in Bristol, Connecticut is $136,100 - $182,400; and the hiring range for this position in San Francisco, California is $148,994 - $199,870 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidates geographic region, job-related knowledge, skills, and experience among other factors. A bonus and\/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and\/or other benefits, dependent on the level and position offered."}
{"id":714,"full_description":"Software Engineering Manager **COMPANY:** HealthMark Group is a leading provider of healthcare release ofinformation solutions, dedicated to simplifying and streamlining the exchangeof medical data between healthcare providers, payers, and patients. We empowerhealthcare organizations to securely and efficiently manage the exchange ofhealth information, ensuring compliance with regulatory requirements whilemaintaining the highest standards of privacy and security. ******LOCATION: DALLAS, TX, Fully remote** ******POSITION: SOFTWARE ENGINEERING MANAGER** ****Are you a first-class developer and mentor? Do you want to build state-of-the-art new software solutions? Do you hold yourself and others to high standards?HealthMark Group might have the perfect job for you.We are looking for a Software Engineering Manager who has a track record ofleading, designing and developing complex web and data applications. As a keymember of HealthMark's software engineering team you will be managingdevelopment teams and be the lead technical expert for a product line. Youwill serve as a technical leader, able to discuss data structures, newtechnologies, and new methods of achieving system goals. You will also provideservant leadership to your team, removing roadblocks, coaching and mentoringas needed, facilitating collaboration with internal customers, and helpingyour team to succeed.The Software Engineer Manager must be able to prioritize well, communicateclearly, have a consistent track record of delivery, excellent softwareengineering, and excellent mentoring skills. Creative engineering balancedwith high quality and a team focus. Must be able to work across multiplefacets of the project and juggle multiple responsibilities at the same time.Strong analytic capability, the ability to design innovative solutions, and apenchant for creative problem solving. We are looking for highly motivatedindividuals who are looking to grow their career in a fast-paced environment.HealthMark Group is building the next generation of software for digitalhealth information, including patient engagement and patient records. We focuson reducing the overall administrative burden of healthcare patient datajourneys **.** ******PRIMARY ROLE AND RESPONSIBILITIES:** ****        * Managing and leading a software development team(s) ****        * Recruit, hire, mentor, and coach software engineers at different levels of experience        * Manage and support the software development lifecycle of new and existing web and data applications in collaboration with Product teams        * Maintaining and drive enhancing a CI\/CD DevOps pipeline to include and improve source code versioning, automated testing (unit and functional), and automated deployments        * Drive application security improvement through security reviews, static and dynamic code analysis, and security scanning.        * Ensure engineering best practices like code reviews, pairing, refactoring, and automated unit testing practices are in place and improve code quality        * Contribute to system architecture, research new technologies        * Support Development teams in designing loosely coupled, highly cohesive software components following SOLID software design principles        * Be a persistent, creative problem solver        * Own all operational metrics and production support for your teams' software        * Maintaining an eye towards security, scalability, performance, and maintainability        * Participating in a mostly remote results driven working environment        * Designing intuitive and easy to use user interfaces ******REQUIRED EXPERIENCE AND QUALIFICATIONS:** ****        * 8+ years of professional software development experience in a Microsoft stack          * SQL Server tables and stored procedures          * C# MVC and APIs          * .NET Core        * Experience mentoring young software developers        * Experience building complex web and data systems that have been successfully delivered to end users        * Excellent troubleshooting and communication skills        * Strong understanding of design and architectural patterns        * Understanding fundamental design principles of a scalable application        * Proficient understanding of code versioning and CI\/CD tools        * Proficient understanding of developing software in the cloud (preferably in AWS)        * Experience with managing Agile software development teams (Scrum and\/or SAFe)        * BS\/BA in Computer Science, Mathematics, Engineering, or related field        * Results Oriented **ADDITIONAL PREFFERED EXPERIENCE** :        * Azure DevOps including YAML        * AWS Certifications        * Agile Certifications        * Html5\/Angular        * Healthcare Industry\/FHIR"}
{"id":438,"full_description":"Oracle Developer ```Job Summary:```  We are seeking an experienced Oracle Developer to join our team. As an Oracle Developer, you will be responsible for designing, developing, and maintaining Oracle databases and applications. You will work closely with our development team to analyze business requirements and translate them into efficient and scalable database solutions.```Responsibilities:```  - Design, develop, and maintain Oracle databases and applications  - Collaborate with cross-functional teams to analyze business requirements and translate them into technical specifications  - Develop efficient SQL queries, stored procedures, and triggers  - Optimize database performance and ensure data integrity  - Troubleshoot and resolve database issues  - Perform data analysis and provide insights to support business decision-making  - Develop and maintain technical documentation**searching for a Sr. Oracle PL\/SQL Developer to help support an upcoming Oracle to AWS Migration of data.** **Skill Set:*** Hiring Team is looking for 6+ years on experience with experience in Enterprise environments.* SQL \/ PL\/SQL expertise* Experience in supporting Oracle Data to AWS Cloud MigrationIf you are a skilled Oracle Developer looking for an exciting opportunity to work on challenging projects, we would love to hear from you. Apply now to join our dynamic team!Job Type: ContractSalary: $107,820.90 - $129,848.82 per yearExperience level:* 7 years* 8 years* 9 yearsSchedule:* 8 hour shiftWork Location: Remote"}
{"id":271,"full_description":"Software Dev Engineer 1 (Fixed-Term 5 years) The Temple Portfolio is seeking a skilled and motivated professional to work as a Software Development Engineer. Our engineering teams work in an agile development environment with multi-disciplined teams to develop and deliver web applications which are used in temples throughout the world. These applications assist patrons, priesthood leaders, temple workers, and temple presidencies to conduct and participate in sacred temple ordinances. We need a software engineer who is excited and passionate about leveraging innovative technologies and contributing their talents to the work of the Church in temples. This will be a unique opportunity to develop and maintain high quality multi-language web applications in temples, and to apply your technical skills to a work which aligns with core gospel beliefs.The Software Development Engineer 1 is an entry-level, professional role responsible for developing and maintaining software source code to support a solution under the close supervision of an assigned technical lead. As a member of a development team, the individual will receive specific work direction, most often from more senior software developers. The individual will be expected to solve less-complex technical issues and complete programming tasks.This is a regular, full-time, fully benefited position with a fixed-term of five years.This individual works with divine guidance to provide or support technology that furthers the mission of the Church and reflects the eternal impact of the gospel.We value early, mid and late-career candidates and encourage all applicants with the posted skills and abilities to apply.  * Participate in the analysis of functional requirements* Participate in the mapping of functional requirements to technical designs* Assist in providing estimates for development tasks* Develop source code and unit tests according to technical designs* Participate in code reviews* Contribute to technical documentation* Participate in the Problem Management process and fix defects* Follow policies, standards, and regulatory requirements and ensure all others are doing the same  Required:Education:* Bachelor's degree in related field or equivalent experienceWork Experience:* 1+ years of relevant professional experience or significant internshipDemonstrated Skills & Abilities:* Basic understanding of Agile Software Development methodologies and principles.* Object-oriented development experience* Java, Spring, SQL, HTML, JavaScript (React) experience a plus* Clear and accurate written communication skills and great attention to detail* Skills in engineering\/programming, analytical\/diagnostic\/troubleshooting, web technology, and programming methodology* Demonstrated aptitude and willingness to learn new technologies and programming languages* Familiarity with applicable software, computer languages, and code to perform the responsibilities of the role* This job operates in a professional office environment* To successfully perform the essential functions of the job there may be physical requirements which need to be met such as sitting for long periods of time and using computer monitors\/equipmentPreferred:* Work experience with the specific solution being supported* Basic understanding of computer systems; knowledge or experience in the tools, methodologies, and technologies to be used  Church employees find joy and satisfaction in using their unique talents and abilities to further the Lords work. From the IT professional who develops an app that sends the gospel message worldwide, to the facilities manager who maintains our buildings— giving Church members places to worship, teach, learn, and receive sacred ordinances—our employees seek innovative ways to share the gospel of Jesus Christ with the world. They are literally working in His kingdom.Only members of the Church who are worthy of a temple recommend qualify for employment. Apart from this, the Church is an equal opportunity employer and does not discriminate in its employment decisions on any basis that would violate U.S. or local law.Qualified applicants will be considered for employment without regard to race, national origin, color, gender, pregnancy, marital status, age, disability, genetic information, veteran status, or other legally protected categories that apply to the Church. The Church will make reasonable accommodations for qualified individuals with known disabilities."}
{"id":623,"full_description":"Mar-10-2024 Sr. Network Engineer Sr. Network Engineer, Masters degree in Information Technology, Computer Science with 2 years experience; Guide network engineering team in deploying MERAKI, Viptela & VeloCloud solution using dashboard and CLI commands; Mentor & train junior network engineers in migration from cisco catalyst platform to cisco nexus 9k,7k,5k, ISR platforms in order to support cisco application centric infrastructure; Plan, acquire, coordinate install hardware (such as routers, switch, firewall) & software(such as ios) to migrate to SD-WAN using Microsoft Visio, SD WAN dashboards and cisco CLI platform; Help engineers with technical issues in network routing and switching problem and work on ServiceNow platform; Test network performance using Scrutinizer, SolarWinds, Infoblox to provide network performance statistics and reports, maintain network infrastructure by monitoring all network equipment in Observium; Perform deep packet inspection to analyze data issues, troubleshoot network downtime issues in organizations network using sniffers and Wireshark; Guide team in building CISCO Digital Network architecture as well as mantling routing protocols such as BGP, OSPF and EIGRP also wan technologys like MPLS; Implement Palo Alto Firewalls firewall features such as threat prevention, high-availability, IPsec tunnels, also security best practices for security policy and security rules and troubleshoot any firewall issues using panoramas logging and monitoring features. Skills: MERAKI, Viptela, VeloCloud, cisco catalyst platform, cisco nexus, ServiceNow, Scrutinizer, SolarWinds, Infoblox, Observium, sniffers & Wireshark. Must be willing to travel and\/or relocate to work in unanticipated locations throughout the US. No Telecommuting. Send resume to A10 Consultancy, Inc, 3105 Emmorton Rd, Suite # 2D, Abingdon, MD- 21009."}
{"id":614,"full_description":"Research Intern **About us**We are a technology company covering research and consulting in diverse engineering and scientific subjects, helping shape the future through innovation and research..Our work environment includes:* Remote Work* Flexible Time* Growth opportunities* Work-from-home daysWe are inviting applications for an internship within the Research Institute of NeoVisionary Technologies Inc. (NVT). The internship begins from April 10th to July 10th of 2024 (one quarter), exploring specific research topics in fields of biology, medicine, and\/or bio-engineering of interest to NVT.This internship is specifically designed for budding scientists - like those graduated or about to graduate (junior or above) from High-School in USA, with a specific inclination to pursue Science and Engineering in their future studies. Applicants must be citizens of Unites States, at or above the age of 15yrs, and be able to work online utilizing computers and softwares used for office purposes (Powerpoint, Word), remote-communications (Emails, File-Share, Zoom\/Google-Meet, etc.).We expect ace students with a good understanding of Biology, Chemistry, Physics and Maths (preferably AP classes in some of these subjects), and be dedicated students to quickly learn under guidance of senior engineers and scientist. Programming skills will be needed (Python, MatLab, C\/C++, or any other language of choice), depending upon the topic of internship. Excellent writing skills are expected, or at least to be picked-up during internship, such that the intern should be able to write at the level of what is written in scientific journals.Job Type: InternshipPay: $0.50 per hourExpected hours: 20 per weekSchedule:* Monday to Friday* Weekends as neededApplication Question(s):* Please confirm that you are either a High School student currently enrolled in a High School in USA at or above the junior level; OR recently graduated High School in USA no more than 2years in the past.Work Location: Remote"}
{"id":570,"full_description":"Junior Systems Engineer A Junior Systems Engineer is an entry-level position in the field of systems engineering. Systems engineering is a discipline that focuses on designing, integrating, and managing complex systems throughout their entire lifecycle. These systems can range from computer systems and software applications to large-scale infrastructure projects.    Key Responsibilities:  * Supporting Senior Engineers: Junior Systems Engineers often work closely with more experienced engineers to learn and assist in various tasks related to system design, development, and maintenance.* Documentation: They may be responsible for creating and maintaining technical documentation, including system design specifications, process documentation, and configuration management records.* Troubleshooting: Identifying and resolving issues with systems, applications, or infrastructure components. This may involve troubleshooting hardware or software problems.* Testing: Conducting tests and quality assurance activities to ensure that systems meet performance and reliability standards.* System Maintenance: Assisting in routine system maintenance tasks, such as updates, patches, and backups.* Collaboration: Collaborating with cross-functional teams, including software developers, network engineers, and project managers, to ensure systems meet project requirements.* Requirements Analysis: Participating in requirements gathering and analysis to understand the needs of the system users and stakeholders.* Research: Staying updated with industry trends and emerging technologies to contribute to the improvement of systems and processes.* Desired Skills  * Experience with cloud computing platforms (AWS, Azure, GCP, Nutanix)* Experience with virtualization technologies (VMware, Hyper-V)* Experience with networking protocols and technologies (TCP\/IP, DNS, DHCP)* Experience with security technologies (firewalls, intrusion detection systems, encryption)* Experience with programming languages (Python, Bash, PowerShell)Qualifications  * Bachelor's degree in computer science, information technology, or a related field* 2-3 years of experience in system administration or a related field* Strong knowledge of operating systems, software, and hardware* Experience with system troubleshooting and problem solving* Ability to work independently and as part of a team* Excellent communication and interpersonal skills  Flexible work from home options available."}
{"id":253,"full_description":"Area Controller Keeney\/Larson Home Services is hiring an Area Controller for a full-time position in Arlington, Wisconsin.    **This is a Monday-Friday schedule, with Friday's working remotely from home.**    The Area Controller is responsible for the integrity of financial reporting for four subsidiary companies located in, Arlington, Neenah, and Delafield, WI. They will also be responsible for the Grand Rapids, MI location, but travel to this location will be only 2-3 times a year. This includes journal entries, subsidiary ledgers, supporting schedules, monthly balance sheet and account analysis; leads and oversees all accounting activities; reviews account payable and accounts receivable; coordinates and directs budgeting and financial forecasting; monitors inventory levels; assists with service pricing policies; sales and use tax filings.    **SUPERVISORY RESPONSIBILITIES:*** Manages the Larson-Keeney Controller who has 3 direct reports between Larson and Keeney.**ESSENTIAL FUNCTIONS:*** Leads month-end closing process for all subsidiary companies including pre-closing review with Larson-Keeney Controller and presents monthly financial results to Business Unit leadership as well as Canopys CEO and CFO.* Serve as a strategic business partner to the founders of Larson and Keeney as well as the WI\/MI Group General Manager.* Ensures adherence to internal controls, accounting policies\/procedures and GAAP including the proper timing\/recognition of revenue and expenses* Leads the preparation of business activity reports, financial forecasts and annual budgets.* Analyzes inventory levels and ensures accuracy of inventory counts and valuation.* Performs analysis of job-level revenue and costs to ensure that profitability goals are met.* Performs fixed asset accounting including capitalization decisions, asset life determination, depreciation calculations and subledger maintenance.* Reviews bank reconciliations and submits required information for compilation of weekly Cash-Debt Report by Canopys CFO.* Reviews accounts payable and accounts receivable agings.* Identify and resolve vendor pricing discrepancies.* Lead onsite annual audit field work and respond to audit requests.**SKILLS:*** Experience with Sage Intacct accounting software, or similar cloud-based GL systems.* Experience with systems migrations from QuickBooks to cloud-based accounting software.* Experience with QB desktop\/online platform preferred.* Experience with transition from Cash to Accrual based accounting.* Advanced knowledge of Excel.* Previous supervisory experience.* High level of accuracy, attention to detail.* Organizational & multi-tasking skills.* Excellent written & verbal communicator w\/listening skills.* Good “player\/coach” and developer of people.**KEY PERFORMANCE INDICATORS (KPI):*** The timeliness and accuracy of daily\/weekly\/monthly reporting.* The level of support and satisfaction of WI\/MI Group leadership as well as Canopys CFO.* The creation of sound and accurate financial reporting tools for the business.* The cultivation of Interpersonal relationships, building and maintaining strong lines of communication and teamwork across all levels of the organization.  **QUALIFICATIONS AND EDUCATION REQUIREMENTS:*** Bachelors degree in Accounting or Business Administration required.* Certified Public Accountant designation required.* 6+ years of related experience required, 3+ years in a management position.* Independent decision maker, self-motivated and organized.* Capable of self-checking accuracy of work as well as reviewing the work of others.  We offer a competitive salary package determined through thorough market research and industry benchmarking. Note: the compensation range is flexible dependent on experience.    If you are interested in this position as an Area Controller, apply today!    #INDPE2023"}
{"id":132,"full_description":"Senior Controls Engineer - Addison Senior Controls Engineer - Addison  Addison, IL Must be a US Citizen or Green Card holder.* The client has a Senior Controls Engineer position available in Addison, IL.* This person will provide project management and hardware engineering leadership in delivering automation systems for a wide variety of industries.* This position requires demonstrated technical proficiency in implementing automation solutions with PLC, DCS, HMI, and SCADA platforms.* The Project Engineer will interact directly with the customer and lead a team of company engineers in identifying requirements, developing specifications, and shepherding automation solutions through the production process.* This position is a leadership role within the business unit and requires strong problem-solving ability, well-balanced people skills, an aptitude for business efficiency, and an interest in creating partnerships.* The Project Engineer demonstrates success by securing repeat work with both new and existing customers.**RESPONSIBILITIES:*** This position requires the ability to deliver innovative automation solutions and design standards either self-directed or as a leader of a team.* The candidate must have the ability to conceptualize, detail and implement control systems for industrial processes and machinery that meet our customers requirements.* This involves the development of a control system architecture, selecting the components to be used, detailing schematic diagrams and system documentation, and functional knowledge of PLC\/HMI\/SCADA systems.* This position requires in-depth knowledge of Controls hardware including Control Panel design, UL508A familiarity, Motor Control Centers, Hazardous area panel design, and industrial instrumentation.* Engineering experience with multiple different voltage levels required.* For larger systems, experience with industrial networking used to connect control system components and instrumentation is preferred.* The Project Engineer would design, detail, and implement a variety of fiber, wired and wireless systems using industrial protocols (Ethernet\/IP, ProfiNET, Modbus, etc.)* The ideal candidate must have a diverse engineering skillset with the ability to work independently. Will act as technical lead on projects and guide lower-level engineers and technicians.* This position also requires performing the Project management role on some projects, instead of hardware engineering or in addition to.* This will involve:+ Developing project execution plans, work breakdown structures and associated budgets+ Task prioritization and scheduling, task ordering, time tracking and reporting.+ Financial tracking and reporting, early problem identification+ Conflict management\/resolution, leading and supporting a team, and attending project status meetings.+ Overseeing daily operations and activities of projects up to $1.5M* This position is often responsible for ensuring the overall profitability of the project.**QUALIFICATIONS:*** **Education**  Bachelor of Science degree in Electrical\/Control Engineering, Mechanical Engineering, Chemical Engineering, or Computer Science is required.* **Experience**  Greater than 10 years with capabilities in below areas is preferred:* Extensive experience in design of electrical schematics, including power distribution of 480VAC, 230VAC, 208VAC, 240VAC,120VAC, and 24VDC.* Background in Hazardous Location Control System Design including Intrinsically Safe Circuits, Purged Panels, Explosion Proof Panels, and Division 2 Panel Design.* Experience with Surge Protection for Power Distribution and IO Protection.* Ability to perform Control Panel FLA, Heating\/Cooling, and SCCR Calculations.* In-depth understanding of Control Panel production process.* Functional understanding of PLC hardware\/software platforms such as Rockwell Automation, Siemens, and Modicon.* Familiarity with HMI\/SCADA hardware\/software platforms such as Wonderware, GE iFIX, Rockwell Automation FactoryTalk View, Schneider, and Siemens.* Understanding of DCS hardware\/software platforms such as Emerson DeltaV or similar.* Experience in industries such as Water\/Wastewater Treatment, Life Sciences, Building Automation, Food and Beverage, Oil & Gas, and Mining.* Experience leading a team of engineers\/technicians to provide control system solutions.* Experience mentoring less experienced engineers.* Professional references, preferably one from each of the following: a subordinate, a peer, and a manager.**TRAVEL:** Ability to travel up to 25% around the Chicago area with occasional out-of-state travel to surrounding states.**PHYSICAL DEMANDS OF POSITION:** Seeing, color perception, hearing, clear speech, dexterity in hands, driving, lifting, ability to mount\/dismount equipment, pushing and pulling.**WORKING ENVIRONMENT:** Standard office environment, on-site office environment, diverse industrial environments, frequent use of a personal computer, facsimile\/copy machines, phones.Required Knowledge, Skills, and Abilities: (Hiring Companies ATS Questions)**:**1. Do you have a Bachelor of Science degree in Electrical\/Control Engineering, Mechanical Engineering, Chemical Engineering, or Computer Science is required.2. Do you have greater than 10+ years of experience, 20 years even better3. Do you have experience in Water\/Wastewater Treatment, Life Sciences, Building Automation, Food and Beverage, Oil & Gas, and Mining.4. Do you have extensive experience in the design of electrical schematics, particularly focusing on their expertise in power distribution across various voltages such as 480VAC, 230VAC, 208VAC, 240VAC, 120VAC, and 24VDC.5. Do you have a background in Hazardous Location Control System Design including Intrinsically Safe Circuits, Purged Panels, Explosion Proof Panels, and Division 2 Panel Design.6. Do you have experience with controls hardware including Control Panel design, UL508A familiarity, Motor Control Centers, Hazardous area panel design, and industrial instrumentation.7. Do you have Engineering experience with multiple different voltage levels8. Do you have experience with Surge Protection for Power Distribution and IO Protection.9. Do you have experience with Perform Control Panel FLA, Heating\/Cooling, and SCCR Calculations.10. Do you have experience PLC hardware\/software platforms such as Rockwell Automation, Siemens, and Modicon.11. Do you have experience with HMI\/SCADA hardware\/software platforms such as Wonderware, GE iFIX, Rockwell Automation FactoryTalk View, Schneider, and Siemens.12. Must be a US Citizen or Green Card holder."}
{"id":450,"full_description":"Front End Software Engineer ### **It's about more than the right fit. We're looking for the right connection.**At Nextiva, it's our team members that make Nextiva a great place to work. Nexties are smart, driven, and the best in class at what they do. We're changing the game in the software industry with the first of its kind, conversation-centric work hub that unifies team collaboration, customer management & engagement in ONE single application.Since its founding in 2008, more than 100,000 companies rely on Nextiva for customer and team communication. We believe in the power of strong connections; connections to our customers with our signature Amazing Service®, our products and services, and most importantly, each other.### **Build Amazing - Deliver Amazing - Live Amazing - Be Amazing**  Nextiva is currently seeking bright and talented individuals for a **Principal** **Software Engineer** position to join our expanding development team. This position is responsible for helping to drive technology efforts which may include architectural design, supporting existing applications, new application development, application testing, and user support. This developer will work with a growing team and help develop new systems from the ground up, as well as support existing applications. A commitment to collaborative problem solving, sophisticated design, and quality product is essential.As a **Principal Front end Software Engineer** you will assist in the development, implementation and management of technology-based business solutions to improve our product offerings. You will assist in the design, coding, testing, and implementation of software applications to meet both functional and technical requirements.**The responsibilities of a Principal Software Engineer** range from: designing systems; writing, developing, testing, and reviewing code; supporting existing applications; liaising with end users to fix defects, find solutions, and test them; adding functionality to applications by designing and implementing solutions; and more.**Key Responsibilities:*** Help one or more teams build and deliver software that solves complex customer problems* Help drive strategic technical decision making* Build RESTful web applications and design distributed systems* Regularly solve problems that span the entire architecture* Use the latest technology and techniques to build distributed, scalable, and fault-tolerant software systems that power our business communication offerings* Help drive the technical roadmap and technology standards* Take a customer-focused approach in working with our product team to prioritize and deliver new features* Deliver testable and maintainable code* Learn on the job new technologies and techniques to support our continuous improvement culture**Qualifications:**Bachelors degree in Computer Science or related field, or equivalent work experience**Experience*** Extensive software development experience* Extensive experience with RESTFul services and APIs design* Experience with automated testing frameworks* Extensive experience designing and using deployment systems* Extensive experience with messaging systems (RMQ, Kafka, Firebase)* Experience with build and packaging systems (Maven, pip, npm, webpack)* Experience with distributed caching systems* Deep understanding of design patterns and as deployed systems using them* Understands and leverages CI\/CD* Understanding of UNIX based systems* Understands secure coding best practices* Drove several multi team architectural improvements or new technology implementations**Language Specific Qualifications*** Language \/ API+ JavaScript- Web Socket- Web RTC- Web Worker API- Broadcast Channel API- Browser Extension+ HTML 5+ CSS \/ Less+ Graph QL+ REST API's* Framework \/ Library+ Angular 15 and up+ REACT Native+ PrimeNG+ Ionic* Storage+ Google Big Query+ Mongo DB+ Google Cloud Storage* SalesForce+ Open CTI knowledge+ APEX Development* Microsoft+ Microsoft Dynamic CTI Connector+ Microsoft Teams app development* Tools \/ Experience+ Postman+ GitHub+ Visual Studio Code+ Microservice deployment using GCP GCloud, GCP Artifact Artifactory, Kubernetes* Experience+ Real time application development+ Mobile development**Nextiva Core Competencies \/ DNA:*** **Drives Results:** The successful candidate will be action oriented, with a passion for solving problems. They will bring clarity and **simplicity** to ambiguous situations. This individual will challenge the status quo; asking what we can do differently and finding ways to create and build more success. S\/he is a change agent, prepared to lead and drive changes as we transform.* **Critical Thinker:** The successful candidate is fact based and data driven, able to understand and articulate the \"why,\" identifying key drivers and learning from the past. They are **forward-thinking**, anticipating problems before they arise. They'll recommend and action well thought out solutions, understanding the risks and dependencies.* **Right Attitude:** The successful candidate will be team-oriented, collaborative and competitive with a winning mindset; they're resilient and able to easily bounce back from setbacks. S\/he will be able to zoom in \/ out, willing to be hands-on to help solve important problems while being a motivating figure for the team along the way. S\/he will embrace a culture of service and learning with a focus on **caring**, supporting and respecting our customers and team members.**Compensation, Rewards & Benefits:**The salary or hourly wage offered by Nextiva to external candidates considers a wide range of factors, including but not limited to skills sets, experience, training, licensure and certifications, etc. Our compensation decisions are dependent on the facts and circumstances of each case. Our estimate of the expected hiring range for the position as posted is $130,000 - $231,000. A different level in the job hierarchy may apply to a specific candidate resulting in a different hiring range.Nextiva provides a comprehensive employee benefits package that includes medical (including supplemental plans for accident, hospitalization and critical illness), telemedicine, dental, vision, disability, life insurance, legal assistance, an Employee Assistance Plan, paid parental bonding leave, PTO for hourly employees and Flexible Time Off (FTO) for salaried employees, an employee long-term savings plan (401k) through Fidelity with Nextiva matching, comprehensive employee wellness programs and loads of learning and development opportunities which are coupled with career paths to last a lifetime.**Interested in joining our amazing team at Nextiva HQ? Apply today as we launch the future of business conversations!****To check out what's going on at Nextiva, check us out on** **Instagram****,** **Instagram (MX)****,** **YouTube****,** **LinkedIn****, and the** **Nextiva blog****.**In 2022, Nextiva has been recognized by Comparably as the 'Best Place to Work' in the following categories: Best Company Leadership, Best CEO for Women, Best Global Culture, and Best Places to Work in Phoenix.Additional workplace awards include 2021 LinkedIn Talent Employee Engagement Champion, Comparably's Best CEO 2021, Best Company Culture 2021 and 2018, Best Company Compensation 2022, 2021 and 2019, and Glassdoor's 2020 Best Places to Work.*Nextiva is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. We prohibit discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.* *Nextiva participates in the E-Verify Program where and as required by law. For additional information about E-Verify visit* *USCIS*.#LI-RQ1 #LI-Remote"}
{"id":619,"full_description":"Senior AutoCAD Technician (Draftman) **Company Overview:**As a Senior CAD Technician \/ Drafter on the Hampton Roads Bridge-Tunnel Expansion Project, you will be responsible for preparing plans to be used in engineering and construction, including highway, bridge, and tunnel components. You will support our engineering department in designing and drafting plans, roadway profiles, cross-sections, and general civil engineering\/infrastructure project elements.The Hampton Roads Connector Partners JV (HRCP) consisting of VINCI Construction, Dragados, and Flatiron has been selected to construct the $3.3BN Design-Build project –the largest civil construction contract ever awarded by the Virginia Department of Transportation (VDOT).    The project scope across a 9-mile section of the I-64 will include a new 3.5-mile bridge-tunnel crossing that will accommodate a total of 8 lanes of capacity across the water, replacement of the existing marine approach bridges, and the addition of a third lane on I-64 in each direction. The twin 45 diameter 1.5-mile tunnels will be bored by TBM, creating the second-largest TBM tunnel opening for a TBM in North America. The project is expected to continue to the end of 2025.**Principle Accountability and Responsibility:*** Prepares means and methods drawings on the construction methods, sequence of works, temporary works, formwork definition as well as lifting operations and logistic issues, including scaffolding and accesses* Ensure that all the Requirements from Employers and any parties are met and that no objections can be provided to the permanent construction* Ensure that the drawings are developed using the workflows set in the CADD Manual* Ensure that those drawings are compliant with the required standards by using designated softwares (AutoCAD, 2D, 3D, and Autodesk Civil 3D)* Work closely with other departments and engineers* Integrate quality and safety measurements and prevent any risks in the execution methods and sequence drawings* Report about the progress of the design development* Circulate the drawings to the design or construction team for their further review and upon review, integrate the received comments through the issuance of reviewed drawings* Train and mentor junior drafters* Assist the engineering department in creating standards, libraries, and templates* Perform other related duties as assigned**Education and Experience:*****Required:**** High school diploma or GED from an accredited institution.* Minimum of 5 years experience as Draftsman\/CAD Designer in the construction industry and in infrastructure works (roadway, bridge, tunnel, etc.).* Minimum 2 years experience using AutoCAD Civil 3D software.* Minimum 1-year experience in Formwork, Work Sequences, and Construction Methods drawings***Strongly Encouraged:**** Associate or bachelor s degree in an applicable field* Experience in infrastructure 3D Modeling such as building pads, alignment, and profile design, roadway modeling, DTM modeling, drainage, cross-sections, and quantity take-offs* Experience with MicroStation GEOPAK SS4 or Bentley Openroads designer* Knowledge or experience in BIM software, such as Revit, Navisworks or Synchro**Key Skills and Knowledge:*****Required:**** Highly developed communication, both written and verbal* Fluent in English with professional proficiency* Commitment to Safety* Strong attention to details***Strongly Encouraged:**** Strong Organizational Skills* High ability to work under pressure"}
{"id":716,"full_description":"Controls Engineer **CONTROL ENGINEER \/ AUTOMATION ENGINEERING TECHNICIAN**"}
{"id":490,"full_description":"ServiceNow Developer (Must be US Citizen, willing to undergo background investigation) emerjence is all about People, Performance and Positive Results. We are a premium IT Software organization, engaged in IT Professional Services and next gen product development.We have a need for a ServiceNow Developer for one of our Federal Government clients.As a **ServiceNow Developer**, youll play a crucial role in configuring and customizing the ServiceNow platform to enhance and automate business processes. Here are some of the key responsibilities and qualifications:Primary Duties and Responsibilities:* Planning, designing, deploying, testing, and integrating solutions.* Provide expertise in the ServiceNow Platform, particularly in ITSM\/ITOM\/ITAM\/SecOps\/IRM.* Ensure adherence to best practices in system development, security, and performance optimization.* Develop knowledge content aligned with enterprise objectives and conduct knowledge transfer sessions.* Take ownership of solution implementation, ensuring high-quality outcomes that enhance user experiences.Technical Qualifications:* At least 5 years of IT experience.* Minimum 5 years of experience in implementing ServiceNow or similar platforms for ITSM, SecOps.* Minimum 3 years of experience with JavaScript or other scripting languages.* Proficiency in RESTful APIs and JSON.* Ability to write clear, maintainable, and bug-free code.Nice To Haves:* Strong understanding of CMDB and alignment with CSDM 4.0.* Familiarity with Scaled Agile Framework (SAFe), Agile\/Scrum, and DevSecOps methodologies.Soft Skills:* Strong problem-solving skills and a solution-oriented approach.* Analytical thinking to understand user needs and develop software accordingly.* Effective communication skills to explain software functionality to both project teams and customers.* Excellent interpersonal skills for collaboration within the team.* Efficient issue identification and resolution during design, testing, and maintenance phases.Job Type: Full-timePay: $125,000.00 - $145,000.00 per yearBenefits:* 401(k)* 401(k) matching* Dental insurance* Health insurance* Paid time off* Vision insuranceCompensation package:* Yearly payExperience level:* 3 years* 4 years* 5 yearsSchedule:* 8 hour shift* Monday to FridayApplication Question(s):* Are you authorized to work for any organization in the US without any sponsorship?* Are you willing to go through Federal Government Background Investigation?Experience:* Service Now Developer: 5 years (Required)Work Location: Remote"}
{"id":380,"full_description":"Salesforce Developer with MuleSoft Experience (REMOTE) Everlight Solar is seeking a skilled Salesforce Developer who will design and code functional programs and applications, producing fully functional software applications according to requirements. As a Salesforce Developer, you play a key role in serving our clients and team members. This will be a full-time, work-from-home \"remote\" position.**Must own a Mac computer and be fluent with the Apple ecosystem of software (iOS, macOS, iWork, etc.)**Everlight Solar is a rapidly growing company and the leader of solar energy in the Midwest. We offer a unique experience that fosters individual growth and rewards performance. Our culture at Everlight is extremely important to us. The work environment is fast-paced and dynamic. We value teamwork, quality, innovation, and customer success. Our ideal candidate is self-motivated, detail-oriented, has excellent problem-solving abilities, is passionate about delivering results on-time, exceeding expectations, and ensuring success for our teams.**Responsibilities:*** Ensure consistent alignment of Sales and Marketing to optimize the sales process with a focus on improving and evolving a qualified lead process, distribution, and management.* Provide Sales and Marketing with accurate reporting on the organization's key performance indicators on a consistent basis including actionable steps to improve the experience delivered to current and future customers* Demonstrated ability to meet deadlines, handle and prioritize simultaneous requests, and manage laterally and upwards* Creative and analytical thinker with strong problem-solving skills* Ability to critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs* Ability to assess the impact of new requirements on Salesforce.com and all upstream and downstream applications, systems and processes**Requirements:*** Minimum two years of experience as a Salesforce.com Developer* Salesforce.com Certified Platform Developer 1 certification required* Salesforce.com Certified Platform Developer 2 certification preferred* Minimum two years of experience as a Mulesoft Developer* MuleSoft Developer Certification - Level 1 Certification Required* MuleSoft Developer Certification - Level 1 Certification Preferred* MuleSoft Certified Integration Architect - Level 1 certification Preferred* Experience building REST and SOAP-based APIs using Mule ESB flows with API-led connectivity architecture.* Proven ability to design and implement new processes and facilitate user adoption.* Strong understanding of the platform, with the ability to build custom apps and objects, formula fields, workflows, custom views, Apex classes and other content of advanced complexity* Strong understanding of Salesforce.com best practices and functionality* Strong data management abilities* A documented history of successfully driving projects to completion* A demonstrated ability to understand and articulate complex requirements* Excellent project management skills and a positive attitude* Must demonstrate exceptional verbal and written communication skills* Must demonstrate ability to communicate effectively at all levels of the organization**Benefits:**  * Health Insurance* Dental Insurance* Vision Insurance* Life Insurance* PTO* Sick and Safe Time* Paid Holidays Off**Salary: $95,000-100,000\/ year***Everlight Solar is proudly an Equal Opportunity Employer. We value diversity of all types and are excited to work with talented individuals from a wide range of backgrounds. Everlight is committed to inclusion and we invite people of any race, creed, color, national origin, ancestry, marital status, sexual orientation, gender identity or expression, disability, nationality or sex, age groups (18+), and levels of education to apply. Authorized to work in the US and background check required.*"}
{"id":35,"full_description":"Survey Technician 2 - Public Works **GENERAL STATEMENT OF DUTIES**  Perform various surveying, computer aided design, and engineering functions requiring moderate technical skill, including work on land surveys, engineering projects, and assisting in reestablishing or witnessing government corners.    **SUPERVISION RECEIVED**  Work under the direct supervision of the County Surveyor, lead worker, or designee who assigns projects or crew assignments and evaluates work performance.    **SUPERVISION EXERCISED**Supervision is not a responsibility; however, this classification may include lead worker duties as defined in the Marion County Personnel Rules.**Typical Duties - Duties include, but are not limited to the following**-------------------------------------------------------------------------* Performs GIS entry into the Survey Graphic Index and plat tracker, calculations and reviews for ORS compliance for Plats and Surveys submitted to the Surveyors Office.* Discuss the ORS review with private surveyors and developers.* Prepares the final Mylar for professional review by the County Surveyor for signature and approval.* Enter final maps (point tagging) into the Survey Graphic Index.* Customer service as required for citizens that come into the Surveyors Office or contact the office by phone.* Reads and interprets notes, maps, and drawings.* Using CAD and computer software, prepare and\/or review legal descriptions and exhibit maps for right-of-way acquisition and\/or easements.* Review legal descriptions and exhibit maps for other divisions.* Use GIS and other survey and clerk records to research projects as assigned.* Perform calculations.* Understand the principles of boundary surveying and property conveyances along with interpretation of evidence and map reading.* Communicate effectively with property owners, private surveyors, and other staff.* Assist with filing and maintaining records, making copies, assisting the public in records research, and other miscellaneous duties.* Serve as crew member for survey field crew.* Helps perform government corner restoration surveys, topographic surveys, road right-of-way surveys, construction surveys and measurements of quantities, using highly accurate total station equipment, global positioning equipment and other survey equipment.* Prepare maps for Public Land Corner Program using ACAD and surveying software.* Other duties as assigned by your supervisor.* Participates in basic through advanced incident command training and drills to maintain proficiency in EOC operations. Assumes any position as assigned in the EOC, up to and including command staff. Emergency Management duties may require working long hours outside normal business hours, weekend\/holiday work, and may occur with little or no advance notice.**Requirements for the Position**---------------------------------**EXPERIENCE AND TRAINING*** Two years of college coursework in surveying or civil engineering; AND* One year of experience in survey work, civil engineering design or computer aided design; OR* Any satisfactory combination of work, education, training, or experience relevant to the position, as determined by Marion County.**PREFERENCES*** Experience in computer aided design and proficiency using AutoCAD software.**SPECIAL REQUIREMENTS*** Possession of, or obtain within 30 days of hire, a valid Class C Oregon driver's license. If in possession of a current out of state driver's license, must obtain Oregon driver's license within 30 days of hire.* Must possess a current driver's license in the applicant's state of residence and an acceptable driving history. Marion County will obtain a copy of the driving record for all qualified applicants from Driver and Motor Vehicle Services and review the driving record according to the Marion County policy and procedure for Driving on County Business. The policy can be found at: http:\/\/apps.co.marion.or.us\/APAP\/.* The finalist for this position will be required to pass a criminal history background check; however, conviction of a crime may not necessarily disqualify an individual for this position.* Final candidates selected for this position may be required to pass a physical examination by a county-appointed medical doctor.* This position is represented by a union.* This is a full-time position, which is eligible for overtime.* Work Schedule: Monday - Friday, 8:00 am - 5:00 pm or the option of 4 (four) 10-hour days, with flexibility depending upon the needs of the department and program.  **KNOWLEDGE, SKILLS, AND ABILITIES**  Knowledge of mathematics, including trigonometry as applied to surveying and engineering, basic surveying and engineering practices and procedures.    Skill and ability to use tools; use a variety of survey and engineering software applications to make computations; conduct research; perform arduous manual tasks; the use of surveying instruments; ability to deal effectively with the public; operate blueprinting and copying machines; follow instructions accurately; keep accurate records; follow oral and written instructions accurately and efficiently.    **PHYSICAL REQUIREMENTS**  Operates a motor vehicle; stands; sits up to 1\/2 hour; moves about the work area; bends forward; stoop position; climbs 1 floor of stairs; crawls on hand and knees at times; reaches overhead; lifts\/pushes\/pulls up to 30 lbs.; moves carts weighing up to 150 lbs.; carries items weighing up to 20 lbs. for up to 100 feet; operates a keyboard; rapid-mental\/hand\/eye\/coordination; speaks in a clear and audible voice; reads at a 12-pt. font; distinguish colors and shades; ability to hear at a normal speech level; may be exposed to heat, cold, humidity, dust, smoke, vibration, uneven areas, rarely radiation, noise, and wet areas; may use ladders and scaffolding; may be exposed to chemicals.**PUBLIC SERVICE LOAN FORGIVENESS**  Marion County is a qualifying public employer for the Public Service Loan Forgiveness Program. Through the Public Service Loan Forgiveness Program, full-time employees working at the County may qualify for forgiveness of the remaining balance on Direct Loans after 120 qualifying monthly payments under a qualifying repayment plan. Questions about your loan eligibility should be directed to your loan servicer or the US Department of Education.**VETERANS PREFERENCE**  Applicants are eligible to use Veterans Preference when applying with Marion County in accordance with ORS 408.225, 408.230, and 408.235 and OAR 105-040-0010 and 105-040-0015. Preference will be awarded only if the applicant meets the minimum requirements of the position and attaches the required documentation at the time of application.**DOCUMENTS REQUIRED FOR VETERANS PREFERENCE*** One of the following:+ MEMBER COPY 4 of the Certificate of Release or Discharge from Active Duty (DD Form 214 or 215); OR+ Letter from the US Department of Veterans Affairs indicating receipt of a non-service connected pension; OR+ Certification that discharge or release from active duty under honorable conditions will take place not later than 120 days after the submission of the certificate.* In addition to one of the above documents, Disabled Veterans must also submit one of the following:+ A copy of their Veterans disability preference letter from the Department of Veterans Affairs; OR+ Certification that medical separation from active duty under honorable conditions will take place not later than 120 days after the submission of the certificate.You can request copies of your military service record through the National Archives website at http:\/\/www.archives.gov\/veterans\/military-service-records\/Marion County is an Equal Opportunity, Affirmative Action, Veteran and Disability employer committed to increasing the diversity of its workforce."}
{"id":131,"full_description":"Hybrid\/Travel days- Hiring a Senior Controls Engineer In Addison, IL PostJobMatches By WorkStaff USA is a leading staffing agency in the job placement industry, providing top-notch professionals to facilities across the country. Our team of experienced recruiters work together to match the best candidates with the right job opportunities.  Today we are hiring a Senior Controls Engineer for our client in Addison, IL. Must have Bachelor of Science degree in Electrical\/Control Engineering, Mechanical Engineering, Chemical Engineering, or Computer Science is required.    **JOB DESCRIPTION:*** Our client has a Senior Controls Engineer position available in Addison, IL.* This person will provide project management and hardware engineering leadership in delivering automation systems for a wide variety of industries.* This position requires demonstrated technical proficiency in implementing automation solutions with PLC, DCS, HMI, and SCADA platforms.* The Project Engineer will interact directly with the customer and lead a team of engineers in identifying requirements, developing specifications, and shepherding automation solutions through the production process.* This position is a leadership role within the business unit and requires strong problem-solving ability, well-balanced people skills, an aptitude for business efficiency, and an interest in creating partnerships.* The Project Engineer demonstrates success by securing repeat work with both new and existing customers.**RESPONSIBILITIES:*** This position requires the ability to deliver innovative automation solutions and design standards either self-directed or as a leader of a team.* The candidate must have the ability to conceptualize, detail and implement control systems for industrial processes and machinery that meet our customers requirements.* This involves the development of a control system architecture, selecting the components to be used, detailing schematic diagrams and system documentation, and functional knowledge of PLC\/HMI\/SCADA systems.* This position requires in-depth knowledge of Controls hardware including Control Panel design, UL508A familiarity, Motor Control Centers, Hazardous area panel design, and industrial instrumentation.* Engineering experience with multiple different voltage levels required.* For larger systems, experience with industrial networking used to connect control system components and instrumentation is preferred.* The Project Engineer would design, detail, and implement a variety of fiber, wired and wireless systems using industrial protocols (Ethernet\/IP, ProfiNET, Modbus, etc.)* The ideal candidate must have a diverse engineering skill-set with the ability to work independently. Will act as technical lead on projects and guide lower-level engineers and technicians.* This position also requires performing the Project management role on some projects, instead of hardware engineering or in addition to.* This will involve:+ Developing project execution plans, work breakdown structures and associated budgets+ Task prioritization and scheduling, task ordering, time tracking and reporting.+ Financial tracking and reporting, early problem identification+ Conflict management\/resolution, leading and supporting a team, and attending project status meetings.+ Overseeing daily operations and activities of projects up to $1.5M* This position is often responsible for ensuring the overall profitability of the project.**QUALIFICATIONS:*** + Bachelor of Science degree in Electrical\/Control Engineering, Mechanical Engineering, Chemical Engineering, or Computer Science is highly preferred but not required.- **Experience with large system process controls in Waster Water\/Water Treatment, Petro Chemical, Bio Chemical or Nuclear industries is key**+ **Experience**  Greater than 15+ years of experience, 20 -25 years even better+ **Must have strong technical experience and willing to perform a technical role and also be comfortable in a management and customer facing role.**- **Will also support sales with new business as a subject matter expert.**+ **Must be able to understand the business side and how fixed bid projects work and how to make them successful.**+ **Must be a problem solver and excellent communicator.**+ Extensive experience in the design of electrical schematics, particularly focusing on their expertise in power distribution across various voltages such as 480VAC, 230VAC, 208VAC, 240VAC, 120VAC, and 24VDC.+ Perform Control Panel FLA, Heating\/Cooling, and SCCR Calculations.+ PLC hardware\/software platforms such as Rockwell Automation, Siemens, and Modicon.+ HMI\/SCADA hardware\/software platforms such as Wonderware, GE iFIX, Rockwell Automation FactoryTalk View, Schneider, and Siemens.+ DCS hardware\/software platforms such as Emerson DeltaV or similar.+ Overseeing daily operations and activities of projects up to $1.5M* **TRAVEL:** Ability to travel up to 25% around the Chicago area with occasional out-of-state travel to surrounding states. Occasional overnight shifts as installs will take place during off\/closed hours.**PHYSICAL DEMANDS OF POSITION:** Seeing, color perception, hearing, clear speech, dexterity in hands, driving, lifting, ability to mount\/dismount equipment, pushing and pulling.**WORKING ENVIRONMENT:** Standard office environment, on-site office environment, diverse industrial environments, frequent use of a personal computer, facsimile\/copy machines, phones.**ABOUT the client:** As a 100% Employee-Owned Company our people are passionate about solving your unique engineering challenges, and with the support of industry experts behind them, they can successfully execute projects of any size while meeting your requirements of scope, schedule, and budget. The client has been providing customers with engineering, system integration and fabrication solutions for more than 40 years. With offices throughout the US and over 500 professionals on our staff, we are one of the largest and most well-established engineering companies in the United States, and we've successfully finished numerous projects for our US clients in many parts of the world. We're confident that our qualified staff has the knowledge, experience, and talent to create and deliver the solutions you need for your facility process and operation needs. This client ranks on Inc. 5000's Fastest-Growing Private Companies list and is a GSA Schedule holder with the Federal Government for professional engineering services and manufacturing.Apply and learn more today!"}
{"id":109,"full_description":"SWE-2 Dashboard UI **SWE-2 - Dashboard UI**========================Want to empower digital business through real-time analytics delivered as a service? Passionate about putting the power of machine data analytics in the hands of everyone by unifying all data types, enabling universal access and leveraging cloud economics all this from a single, unified platform delivered and consumed as a service? Come talk with us!As a Frontend Engineer in the dashboard team, you will be part of our continuous intelligence platform portfolio.**What you will do:*** **Build** a rich user interface primarily for our mission-critical high-availability analytics platform using **React** and **TypeScript*** Participate in **user experience design**, and **architecture initiatives** and **lead regular code reviews** with a major focus on ease of use, visual appeal, re-usability, and performance* Instrument and measure UI **performance** with well-defined SLIs to provide best-in-class experience for customers* **Collaborate** with feature and component teams during both design and development phases to ensure adherence to UI architectural standards and best practices* Evaluate, test and provide technology and design recommendations* Write detailed **design documents** and documentation on system design and implementation* Promote cross-team awareness to optimize code-sharing and decrease time to market **Requirements*** Bachelor's Degree in Computer Science or related discipline* 2-4 years of industry experience with a proven track record of ownership **(This is not a new grad role and not a Senior role)*** Experience with Javascript, Typescript, react, redux* Understand the performance characteristics of commonly used data structures (maps, lists, trees, etc)* Desire to learn Scala, an up-and-coming JVM language (scala-lang.org)**Desirable:*** Experience in multi-threaded programming and distributed systems is highly desirable* Experience in big data and\/or 24x7 commercial service is highly desirable* You should be happy working with Unix (Linux, OS X)* Agile software development experience (test-driven development, iterative and incremental development) is a plus* Enjoy working in an environment where stuffed squirrels and rubber bands are occasionally hurled at you**About Us**Sumo Logic, Inc. empowers the people who power modern, digital business. Sumo Logic enables customers to deliver reliable and secure cloud-native applications through its Sumo Logic SaaS Analytics Log Platform, which helps practitioners and developers ensure application reliability, secure and protect against modern security threats, and gain insights into their cloud infrastructures. Customers worldwide rely on Sumo Logic to get powerful real-time analytics and insights across observability and security solutions for their cloud-native applications. For more information, visit www.sumologic.com.Sumo Logic Privacy PolicyThe expected annual base salary range for this position is **$110,000 - $144,000** + full benefits. Compensation varies based on a variety of factors which include (but arent limited to) role level, skills and competencies, qualifications, knowledge, location, and experience.**Other details:*** Medical, Dental, Vision- Insurance* 401k and Life Insurance options* Unlimited PTO with 15 days of recognized holidays* Quarterly Wellness days - 4 per year* 100% remote with option to be in office if you want (Bay Area, Austin, Denver)* Lunch budget when you work from the office* 3 months of paid parental leave"}
{"id":613,"full_description":"Network Engineer **Job Title: Network Engineer****Location:** DMV Area (Washington D.C., Maryland, Virginia)**Clearance Requirement:** TS\/SCI with Polygraph**About the Role:**We are seeking a highly skilled Network Engineer to join our dynamic team in the DMV area. As a Network Engineer, you will be responsible for designing, implementing, maintaining, and supporting our organization's network infrastructure. This role offers an exciting opportunity to work on cutting-edge technologies and contribute to the security and efficiency of our network operations.**Key Responsibilities:**- Designing and implementing network solutions based on business requirements and security guidelines.- Configuring and managing network devices such as routers, switches, firewalls, and load balancers.- Monitoring network performance and troubleshooting network issues to ensure maximum uptime and reliability.- Performing network maintenance tasks such as software upgrades, patches, and configuration changes.- Collaborating with cross-functional teams to support network integration with other systems and applications.- Conducting security assessments and implementing measures to safeguard network infrastructure against cyber threats.- Documenting network configurations, procedures, and troubleshooting steps for knowledge sharing and future reference.- Providing technical support and guidance to junior network engineers and other IT staff.**Qualifications:**- Bachelor's degree in Computer Science, Information Technology, or related field.- Minimum of 5 years of experience in network engineering roles.- In-depth knowledge of networking protocols, including TCP\/IP, DNS, DHCP, VLANs, and VPNs.- Hands-on experience with Cisco, Juniper, Palo Alto, or other networking equipment.- Strong understanding of network security principles and best practices.- Experience with network monitoring tools such as Wireshark, SolarWinds, or Nagios.- Excellent problem-solving skills and attention to detail.- Ability to work independently and as part of a team in a fast-paced environment.- TS\/SCI clearance with Polygraph is required.**Preferred Qualifications:**- Cisco Certified Network Professional (CCNP) or equivalent certification.- Experience with cloud networking technologies (e.g., AWS, Azure, Google Cloud).- Familiarity with software-defined networking (SDN) concepts and technologies.- Experience working in a government or defense contracting environment.**Application Process:**To apply for this position, please submit your resume and cover letter detailing your relevant experience and qualifications. Only candidates with an active TS\/SCI clearance with Polygraph will be considered. We thank all applicants for their interest; however, only those selected for an interview will be contacted.Job Types: Full-time, ContractPay: $96,066.11 - $153,649.51 per yearSchedule:* 8 hour shiftAbility to Relocate:* Sterling, VA 20166: Relocate before starting work (Required)Work Location: In person"}
{"id":725,"full_description":"Software Developer (Hybrid role) Description: _First things first …_Are you ready to illuminate your career with a dynamic and innovative team?Heads Up Technologies is seeking a **Software Engineer** as part of ourEngineering Team within the Software Development Group. The Software Engineerwill be responsible for designing and implementing properly documented,reliable software that ensures safe and proper execution of microprocessorand\/or DSP-based electronic products\/systems.   _Key Details:_* Work Days and Hours: Our normal working hours for Engineering are 8:00 am-4:00 pm Monday-Friday including a one-hour lunch. Employees are encouraged to use \"flex\" hours (i.e. arrive between 6:00 and 9:00 am) to accommodate traffic.* Location: This is an onsite position located in Addison, TX.*Description: _First things first …_Are you ready to illuminate your career with a dynamic and innovative team?Heads Up Technologies is seeking a **Software Engineer** as part of ourEngineering Team within the Software Development Group. The Software Engineerwill be responsible for designing and implementing properly documented,reliable software that ensures safe and proper execution of microprocessorand\/or DSP-based electronic products\/systems.   _Key Details:_* Work Days and Hours: Our normal working hours for Engineering are 8:00 am-4:00 pm Monday-Friday including a one-hour lunch. Employees are encouraged to use \"flex\" hours (i.e. arrive between 6:00 and 9:00 am) to accommodate traffic.* Location: This is an onsite position located in Addison, TX.* Compensation: Based on background, experience, and comprehensive benefits package.   _What we do:_At Heads Up Technologies, it has been our privilege to work with some of themost respected names in the aerospace, aviation, and entertainment industries.While our customers vary widely in size, market, and geographic location, theyall come to Heads Up for the same reason: Heads Up's commitment to deliveringhighly innovative solutions that enhance their end user's experience.The company is well-positioned for continued growth and expansion and haspartnered with a proven private equity firm to enable their growth goals.   _What you 'll do and what will make you successful in this role:_ **Job Responsibilities*** Software design and development of microprocessor and\/or DSP-based electronic products and systems.* Working with engineering prototypes and production designs from concept through manufacturing release.* Participate in hardware\/software integration of multiple system components.* Take software lead on specific projects following department processes and standards and ensure the design functionally meets customer requirements.* Participate in R&D and new product design efforts. **Required Qualifications*** Bachelor of Science degree in Computer Science or Electrical Engineering (BSCS, BSEE) or equivalent.* Five (5) - ten (10) years of software design experience.* Must be familiar\/experienced with the C programming language in Embedded Systems\/Real-Time OS\/Windows OS.* Experience and an understanding of software design, and test\/verification techniques, including system integration (hardware\/software\/mechanical) of multiple components. * Experience with Ethernet and microprocessor \/ DSP-based products including concept, design, testing, verification, integration, documentation, etc.* Logical thought processes, excellent attention to detail, and ability to conceptualize, implement, and document innovative solutions.* Ability to read and understand schematics and datasheets.* Strong problem-solving skills relating to software design. * Requires little supervision, go-getter, ability to learn on your own and seek out new responsibilities.* Positive interpersonal skills in dealing with co-workers.   **Desired Qualifications*** Experience with diagnostic tools (oscilloscopes, logic analyzers, spectrum analyzers, etc.). * Experience with HTML\/CSS\/JS and\/or Front-End GUI Design. * Experience with one or more Real-Time Operating Systems. * Familiarity with GIT\/CVS or other code archiving tools.* Experience with Assembly languages.* Experience with Linux OS tools, Bash scripts.* Familiarity with DO-178C.* Familiarity with FAA and\/or Mil Spec requirements.   _Perks and Benefits_* A competitive compensation package, including medical, dental, and vision coverage.* Opportunities to plan for the future with our 401(k) program.* Paid Time Off - Take the well-deserved time off you need.* Life Insurance - Enjoy the peace of mind that comes with life insurance coverage.* Health and wellness benefits including Health Savings Account (HSA) option.* Opportunities for professional growth and development within the company.* Positive and inclusive work culture.   _Why Us?_At Heads Up Technologies, you have the opportunity and support to reach forthe sky collaborating internally and with partners to deliver artistry inengineering.  Every position in our company has its unique responsibilities, but they allrequire the same traits: motivated, self-starter, creative, enthusiastic anddependable. A team player that has respect for the opinions and input ofothers. Performance- and process-driven. Someone who gives 110% at work, butstill seeks balance by making time with family and hobbies a priority.  Did this post spark something in you? If so, we're looking forward toreviewing your resume.  No recruiting agencies.Requirements:   **Tentamus North America** , is seeking a strong **Software Developer** toassist with the development of our internal laboratory IMS (LIMS). **Main responsibilities:**        * Developing applications, scripts and modules for our LIMS (laboratory information management system) in cooperation with internal lab customers.        * Supporting laboratory software solutions, optimization of software and processes in the laboratory environment, adaptations according to own and external requirements.        * Advising colleagues in the laboratory as well as support for technical problems with hardware and software - in cooperation with IT department.        * Creating and updating documentation and process descriptions.        * Work with the Development team on projects for labs in the U.S. and globally. **Qualifications:**        * Associates or Bachelors' degree in business or information technology or comparable training        * 6+ years development experience preferred        * Relevant programming skills in languages: JAVA, React, Groovy, HTML, XML, SQL and Crystal Reports are desirable        * Knowledgeable with REST\/SOAP API's        * Professional experience in project management        * Knowledge in requirements analysis, customizing and programming, testing and ticketing systems are an advantage        * Dynamic, assertive, creative and organized individual        * Economic and entrepreneurial thinking skills        * Ability to work from home 2 days per week and able to commute to our lab in Grand Prairie, TX **What we offer you:**        * Competitive salary        * Comprehensive and low-cost benefits package        * 401k with 3% match        * Industry stability with global presence        * Company that is growing        * Challenging tasks, a motivated team and a long-term perspective        * A family-conscious working environment ** _Labs for Life_**. We are a global network of full-service accreditedanalytical laboratories providing crucial quality and safety analysis forclients locally, nationally, and beyond using proven methods of chemistry andmicrobiology. Many of the products you use and consume daily rely on Tentamuslabs. With 18 labs in the U.S. and growing (100 globally), we celebrate havingthe most talented diverse scientific and service-oriented professionals in theindustry. _ **www.tentamus.com**_     ** _Job Posted by ApplicantPro_**"}
{"id":542,"full_description":"Project Manager\/ Junior Project Manager Civil Science is currently seeking a qualified **Project Manager or Junior Project Manager** in our **St. George, Utah** office to join our team. As a Project Manager\/ Junior Project Manager, you will play a crucial role in supporting the planning, execution, and completion of projects. Working under the supervision of Office Manager, you will assist in coordinating various aspects of project initiatives, ensuring they are completed on time, within scope, and within budget. In this role, you will work collaboratively with your team to coordinate and manage both engineering projects and growing our regional presence. Key engineering projects are focused on large scale Water\/ Stormwater design and construction management, municipal infrastructure projects of all sizes.**Responsibilities*** Assist in developing project plans, timelines, and budgets.* Coordinate project activities, ensuring alignment with project objectives.* Collaborate with senior project managers to identify potential risks and develop mitigation strategies.* Maintain regular communication with internal teams, clients, and external stakeholders.* Provide updates on project progress, milestones, and potential issues.* Prepare reports summarizing project status, key performance indicators, and other relevant metrics.* Use data insights to support decision-making processes.* Monitor project deliverables to ensure they meet quality standards.* Implement quality control measures to identify and address issues promptly.* Assist in managing project budgets, tracking expenses, and identifying cost-saving opportunities.* Work with financial teams to ensure accurate and timely invoicing.* Ensure that projects adhere to all applicable laws and regulations.* Work closely with cross-functional teams, including engineers, planners, and other project stakeholders.* Identify and address project-related challenges in a proactive manner.  **Minimum Requirements*** Bachelor's Degree in Civil Engineering or related field, PE Required* Technical knowledge of civil engineering related services including Water and Stormwater design, land surveying, construction oversight, and planning.* Strong organizational and time-management skills.* Excellent communication and interpersonal skills.* Familiarity with project management tools and methodologies.* Existing client relationships within the Utah\/ Nevada area such as municipalities, districts, and agencies.* History of managing project teams while mentoring a staff of engineers and designers* Experience writing proposals, contract management, and client management.* Previous experience with identifying, marketing, and securing projects with local governments.**Preferred Requirements*** Experience using Civil3D design software during the design of Water infrastructure, sanitary sewer and water systems, stormwater management facilities, site grading, and other water \/ stormwater related software.**What We Offer*** **Real Ownership in the Firm**: While most companies offer you the option to purchase stock at some undisclosed time in the future, Civil Science is an employee-owned firm that maintains an Employee Stock Ownership Plan (ESOP) which provides significant opportunities for career growth and savings for retirement.* **Growth**: Since Civil Science is an agile firm, it allows our employees the freedom to own their projects, and step into new, exciting roles without the red tape of large corporations.* **Work-Life Integration**: At Civil Science, our priority is to make sure your work is compatible with your life outside of the office, allowing you time to enjoy with your family or engage in hobbies.* **PTO\/Holidays**: Civil Science offers an annual three weeks of paid time off, six holidays, and two floating holidays to use at your convenience.* **Medical, Dental, and Vision Benefits*** **Life Insurance and Short\/Long Term Disability**: In an effort to prepare for the unexpected, we offer 100% employer covered Life Insurance, Short Term Disability, and Long-Term Disability.* **Tuition Reimbursement**: We maintain a culture focused on individual development and believe in continuing to perfect our craft.* **Additional Retirement Benefits**: In addition to our ESOP, Civil Science offers a 401K plan.**About Civil Science**Civil Science is a full-service civil engineering firm established in 2002 through an employee buyout of a local firm which has been continuously providing consulting engineering services since 1978. Civil Science provides services through the expertise of highly qualified professional engineers, licensed surveyors, planners, and a support pool of technicians to a wide array of both public sector and private clientele in multiple states. In 2015, Civil Science transitioned to a 100% Employee-Owned company in order to benefit our employees and clients through increased collaboration and commitment.In addition to employee ownership in our firm, we will provide you with continued career growth by combining your technical expertise, work ethic, and ability to market\/manage projects, with our 30 plus years of experience, world class professionals, and long-term vision as we continue our growth. If joining a firm that offers employee ownership, leadership and mentoring opportunities, established client relationships, and a vision towards growth piques your interest then we look forward to hearing from you!*Civil Science evaluates and determines on a case-by-case basis whether it is willing to sponsor an individual to receive a temporary or permanent work visa (e.g., E-3, H-1B, H-1B1, or TN visa status).**Civil Science provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state, or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training.*"}
{"id":370,"full_description":"Salesforce Developer with MuleSoft Experience (REMOTE) Everlight Solar is seeking a skilled Salesforce Developer who will design and code functional programs and applications, producing fully functional software applications according to requirements. As a Salesforce Developer, you play a key role in serving our clients and team members. This will be a full-time, work-from-home \"remote\" position.**Must own a Mac computer and be fluent with the Apple ecosystem of software (iOS, macOS, iWork, etc.)**Everlight Solar is a rapidly growing company and the leader of solar energy in the Midwest. We offer a unique experience that fosters individual growth and rewards performance. Our culture at Everlight is extremely important to us. The work environment is fast-paced and dynamic. We value teamwork, quality, innovation, and customer success. Our ideal candidate is self-motivated, detail-oriented, has excellent problem-solving abilities, is passionate about delivering results on-time, exceeding expectations, and ensuring success for our teams.**Responsibilities:*** Ensure consistent alignment of Sales and Marketing to optimize the sales process with a focus on improving and evolving a qualified lead process, distribution, and management.* Provide Sales and Marketing with accurate reporting on the organization's key performance indicators on a consistent basis including actionable steps to improve the experience delivered to current and future customers* Demonstrated ability to meet deadlines, handle and prioritize simultaneous requests, and manage laterally and upwards* Creative and analytical thinker with strong problem-solving skills* Ability to critically evaluate information gathered from multiple sources, reconcile conflicts, decompose high-level information into details, abstract up from low-level information to a general understanding, and distinguish user requests from the underlying true needs* Ability to assess the impact of new requirements on Salesforce.com and all upstream and downstream applications, systems and processes**Requirements:*** Minimum two years of experience as a Salesforce.com Developer* Salesforce.com Certified Platform Developer 1 certification required* Salesforce.com Certified Platform Developer 2 certification preferred* Minimum two years of experience as a Mulesoft Developer* MuleSoft Developer Certification - Level 1 Certification Required* MuleSoft Developer Certification - Level 1 Certification Preferred* MuleSoft Certified Integration Architect - Level 1 certification Preferred* Experience building REST and SOAP-based APIs using Mule ESB flows with API-led connectivity architecture.* Proven ability to design and implement new processes and facilitate user adoption.* Strong understanding of the platform, with the ability to build custom apps and objects, formula fields, workflows, custom views, Apex classes and other content of advanced complexity* Strong understanding of Salesforce.com best practices and functionality* Strong data management abilities* A documented history of successfully driving projects to completion* A demonstrated ability to understand and articulate complex requirements* Excellent project management skills and a positive attitude* Must demonstrate exceptional verbal and written communication skills* Must demonstrate ability to communicate effectively at all levels of the organization**Benefits:**  * Health Insurance* Dental Insurance* Vision Insurance* Life Insurance* PTO* Sick and Safe Time* Paid Holidays Off**Salary: $95,000-100,000\/ year***Everlight Solar is proudly an Equal Opportunity Employer. We value diversity of all types and are excited to work with talented individuals from a wide range of backgrounds. Everlight is committed to inclusion and we invite people of any race, creed, color, national origin, ancestry, marital status, sexual orientation, gender identity or expression, disability, nationality or sex, age groups (18+), and levels of education to apply. Authorized to work in the US and background check required.*"}
{"id":713,"full_description":"IT Manager **Yogurtland  Hiring: IT Manager  Pay: $120,000\/yr.  Shift: ****Monday through Friday days, some nights and weekends.  Location: Dallas, TX (Hybrid Role)**As a company **IT Manager** you will manage (plan, organize, lead and control)a team of IT resources (database\/BI lead, web application analyst, and, end-user support analyst), outsourced vendor services (SaaS application vendors,application partners, systems and network engineering), and, design, develop,implement and operate systems interfaces that integrate disparate platformsfor franchise management, accounting, supply chain, and Point of Sale (POS).The **IT Manager** will oversee staff in the day-to-day performance of theirjobs, providing direction and prioritization of activities based on businessneed. Ensures that projects are planned and tracked toward meeting theirmilestones and adhering to approved budgets. The **IT Manager** will be thepoint of escalation for resolving end-user problems, and, will provide thedocumentation and training needed to empower the user to be more tech savvyand independent.The **IT Manager** will position themselves as a trusted advisor to thefunctional and departmental leadership team and management, earning theirtrust through effective communications and follow through. They will analyzeexisting operating procedures and determine development and qualityimprovement plans. They will manage supplier contracts, maintenance agreementsand upgrades, managing IT expenses and contributing to the annual budgetingprocess.CULTURAL QUALIFICATIONSIn everything the Project Manager does, he or she needs to be:        * THTK - Totally Honest, Totally Kind        * Humble - modest, respectful and open        * Heart & Soul - passionate and totally committed        * Team Play - selfless and team first        * Imaginative - innovative, bold and whimsical **Responsibilities:**        * Lead and manage the IT and store support teams, promoting a culture of collaboration and continuous improvement.        * Mentor and develop IT staff, focusing on skills related to both technical support and customer service.        * Conduct regular team meetings and performance evaluations.        * Develop IT strategies that align with overall business objectives, with a particular focus on enhancing store-level operations.        * Plan and oversee the implementation of new IT systems and upgrades, ensuring minimal disruption to store operations.        * Ensure the continuous operation of IT systems across all stores, with particular attention to POS systems, network infrastructure, and other critical store-level technologies.        * Oversee the installation, configuration, and maintenance of hardware and software in stores, ensuring all components are functioning optimally.        * Provide specialized support for POS systems, ensuring all transactional and operational functionalities meet store requirements.        * Troubleshoot and resolve issues related to POS systems promptly to minimize downtime and customer inconvenience.        * Implement and monitor security measures to protect store and customer data, with a strong focus on POS system security and PCI compliance.        * Conduct regular security audits and updates to safeguard against threats.        * Manage contracts and relationships with technology providers, ensuring they deliver value and meet the needs of each store.        * Develop and manage budgets for store IT needs, including POS systems, ensuring cost-effective allocation of resources.        * Manage IT projects with an emphasis on store integration and support, ensuring smooth rollouts and minimal impact on daily operations.        * Oversee the integration of POS systems with other business systems, ensuring seamless data flow and functionality across store operations. **Requirements:**        * BS in Computer Science (or software engineering) required        * 5+ years of technical experience        * 3+ years supervisory experience        * 5+ years of store systems experience (Micros POS, Clover\/Bypass POS)        * 5+ years of supply chain systems and technology        * 3+ years of experience w\/PCI DSS requirements and solutions.        * Must have strong QA experience. **Benefits:**        * Medical, Dental, Vision        * Paid Time Off        * 401kEqual Opportunity Employer"}
{"id":555,"full_description":"Software Developer We are looking for a Software Developer to build and implement functional programs. You will work with other Developers and Product Managers throughout the software development life cycle.    In this role, you should be a team player with a keen eye for detail and problem-solving skills, with experience in Agile frameworks and popular coding languages. (e.g. JavaScript)    Your goal will be to build efficient programs and systems that serve user needs.    **Responsibilities:**    * Work with developers to design algorithms and flowcharts* Produce clean, efficient code based on specifications* Integrate software components and third-party programs* Verify and deploy programs and systems* Troubleshoot, debug and upgrade existing software* Gather and evaluate user feedback* Recommend and execute improvements* Create technical documentation for reference and reporting  **Qualifications:**    * Experience as a Software Developer, Software Engineer or similar role* Familiarity with Agile development methodologies* Experience with software design and development in a test-driven environment* Knowledge of coding languages (e.g. C++, Java, JavaScript) and frameworks\/systems (e.g. AngularJS, Git)* Experience with databases and Object-Relational Mapping (ORM) frameworks (e.g. Hibernate)* Ability to learn new languages and technologies* Excellent communication skills* Resourcefulness and troubleshooting aptitude* Attention to detail* Degree in Computer Science, Engineering or a related field    This is a remote position."}
{"id":667,"full_description":"Android Developer *  **Location: 100% onsite all 5 days\/ week at Irving, TX**          *  **Needs to clear a online coding challenge** - e.g: making HTTP requests to retrieve data, or parsing JSON responses, and displaying or manipulating the data within a software application **Top 5 Must have requirements:**          * Expertise in Android applications development.          * Expertise in RESTful APIs integration, mockito.          * Expertise in CI\/CD development.          * Expertise in Instrumentation and debugging post production deployment issues.          * Attention to detail. **Responsibilities**  As an Android Engineer you are joining a multidisciplinary team of productmanagers, designers and engineers who create digital products that hundreds ofthousands of people experience every day. You must have a strong andcontinuously growing proficiency in Android application development usingJava, Kotlin. This includes actively participating in designing, developing,reviewing, unit testing and releasing apps for Android powered devices todrive our digital products. The ideal candidate has a passion for code andputting the customer first and delivering an exceptional experience throughthe creation of extendable and re-usable products. **Top 5 Must have requirements:**          * Expertise in Android applications development.          * Expertise in RESTful APIs integration, mockito.          * Expertise in CI\/CD development.          * Expertise in Instrumentation and debugging post production deployment issues.          * Attention to detail. **Required Qualifications:**          * 10+ years of experience in Android App Development using Java, Kotlin.          * 7+ years of experience integrating RESTful APIs.          * 7+ years of experience writing unit and instrumented tests using Robolectric, Mockito AndroidX.          * Proficient with Android SDK.          * Experience with Kotlin for Android development.          * Expertise in MVVM Architectire.          * Expertise in Dependency injection, Annotations, Gradle.          * Experience with offline storage, threading, performance tuning and optimization.          * Experience with localization\/internationalization of the applications.          * Experience with security protocols in the mobile applications eco system.          * Solid understanding of object oriented and functional programming.          * Good understanding of Google's Android design principles and interface guidelines.          * A team player with a start-up\/intrapreneur mindset.          * Experience with CICD pipelines and deploying apps to Google Play store.          * Excellent written and verbal communications skills. **Preferred Qualifications:**          * Ability to work in an Agile \/SCRUM environment.          * Familiarity with code versioning tools - Git (Gitlab).          * Competency in Microsoft Office suite.          * Experience with Agile tools that support tracking iterative development.          * Exposure to retail industry, experience with e-commerce applications.Job Type: ContractPay: $75.00 - $85.00 per hourExperience level:          * 5 yearsSchedule:          * Monday to FridayExperience:          * Android development: 6 years (Preferred)          * Jetpack Compose: 1 year (Preferred)          * Kotlin Multiplatform framework: 1 year (Preferred)Ability to Commute:          * Irving, TX 75063 (Required)Ability to Relocate:          * Irving, TX 75063: Relocate before starting work (Required)Work Location: In person"}
{"id":720,"full_description":"Software Engineer (Senior Developer\/Business Analyst) We are seeking a Software Engineer (Senior Developer\/ Business Analyst) tobecome an integral part of our team! You will be responsible for creating andmodifying computer application software or specialized utility programs. **Responsibilities:**        * Involve in all the phases of Software Development Life Cycle (SDLC) and Software Testing Life Cycle (STLC)        * Associate with business users and other stake holders of the project to ensure there are no gaps in requirements and add\/update the business and technological specifications accordingly        * Identify the scope of the project to ensure delivery is compliant with scope commitment        * Expertly construct user stories and workflows of the feature in support of the CRM implementation        * Carry out data analysis, transformation, and loading utilizing Data Loader during functional testing        * Create and translate use cases and test scripts for usage in automated regression testing, which involves working on customizing the pages with the required lightning component through Community Builder        * Involve in Quality Center\/ ALM administration to create users, groups, domains, and projects.        * Prepare automation test strategies, test plans and test schedules for all Prescriptive CRM applications.        * Involved in tech modernization projects like SQL Server upgrade, Windows 2003 Server Elimination and Office migration.        * Execute test scenarios in different SQL compatibility levels to verify the remediated SQL code and their impacts in legacy applications.        * Perform SQL database related operations to create and modify data and execute store procedures by passing parameters.        * Build and Execute automation scripts using open source tools such as Selenium Web Driver and Test NG.        * Designing and enhancing test automation scripts using HP Unified Functional Testing and ALM        * Build automation suites for traditional Waterfall and Agile projects **Qualifications:**        * Previous experience in software development, computer engineering, or other related fields        * Knowledge of Java, Python, or other programming languages        * Familiarity with relational databases such as MySQL, Oracle, and SQL Server        * Deadline and detail-oriented        * Strong analytical and critical thinking skills"}
{"id":517,"full_description":"Software Engineer Stf \/ Embedded \/ C++ \/ Orlando, FL **Job ID:** 651791BR  **Date posted:** Jan. 02, 2024  **Program:** Orlando \/ AP \/ SP \/ SP E IRAD    **Description:**Help us deliver cutting edge software for our nation's defense!    Lockheed Martin is a global security and aerospace company that employs approximately 114,000 people worldwide and is principally engaged in the research, design, development, manufacture, integration and sustainment of advanced technology systems, products, and services. Lockheed Martin Missiles and Fire Control (MFC) is one of four Lockheed Martin business areas. MFC is a recognized designer, developer and manufacturer of precision engagement aerospace and defense systems for the U.S. and allied militaries.    MFC is looking for an experienced Software Engineer to develop embedded software. Selected candidate will integrate algorithms into C++ applications. Candidate is expected to be proficient in C\/C++. It is desirable that the candidate have experience with embedded development using a real-time operating system. For this first assignment, the candidate will work in a team with both technical and career leaders.    Candidates applying to this position should have a Bachelor's degree, or greater, in Computer Engineering, Software Engineering, Computer Science or an equivalent field with significant software development experience.    It is possible that travel will be required to both customer and supplier sites. It is possible that travel will be both within and outside the Continental United States (CONUS). Telecommuting opportunities can vary depending on daily tasking. For more details about the classification of this assignment, please see \"Ability to Work Remotely\".    Candidates filling this position will need to be a citizen of the United States and may need a clearance at the level specified in \"Clearance Level\" or will need the ability to get a clearance if not specified. In addition to meeting security clearance requirements, candidate may need to be approved to work Special Access Program (SAP) prior to start of employment.    #MFC23  **Basic Qualifications:**  * C++ 11 or greater* Embedded real-time C++ software development on embedded real-time operating system (RTOS)**Desired Skills:**  * Experience with Software Pipeline CI\/CD* Experience with EO\/IR and laser systems* Agile Scrum* Data Distribution Service (DDS)* Design pattern usage* Full software life-cycle development- Git - source code versioning  * Graphical User Interface (GUI) development- Jira - issue tracking and agile project management  * Multi-core and multi-threaded C++ programming* Multi-core Intel* Operational Flight Program (OFP)- Qt - GUI development tool  * Simulation development experience* Software configuration management* Software issue tracking* Visual Studio**Security Clearance Statement:** This position requires a government security clearance, you must be a US Citizen for consideration.  **Clearance Level:** Secret with Investigation or CV date within 5 years  **Other Important Information You Should Know**  **Expression of Interest:** By applying to this job, you are expressing interest in this position and could be considered for other career opportunities where similar skills and requirements have been identified as a match. Should this match be identified you may be contacted for this and future openings.  **Ability to Work Remotely:** Part-time Remote Telework: The employee selected for this position will work part of their work schedule remotely and part of their work schedule at a designated Lockheed Martin facility. The specific weekly schedule will be discussed during the hiring process.  **Work Schedules:** Lockheed Martin supports a variety of alternate work schedules that provide additional flexibility to our employees. Schedules range from standard 40 hours over a five day work week while others may be condensed. These condensed schedules provide employees with additional time away from the office and are in addition to our Paid Time off benefits.  **Schedule for this Position:** 4x10 hour day, 3 days off per week  **Lockheed Martin is an Equal Opportunity\/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.**  **The application window will close in 90 days; applicants are encouraged to apply within 5 - 30 days of the requisition posting date in order to receive optimal consideration.**  Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They're dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about.    As a leading technology innovation company, Lockheed Martin's vast team works with partners around the world to bring proven performance to our customers' toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories.  **Experience Level:** Experienced Professional  **Business Unit:** MISSILES AND FIRE CONTROL  **Relocation Available:** Possible  **Career Area:** Software Engineering  **Type:** Full-Time  **Shift:** First"}
{"id":336,"full_description":"Chief Technology Officer *Weddings.io –* *Los Angeles**, California*  Wedding.io is our CEO Tye Alli new tech upstart and you don't want to catch him by the office water fountain as he will sure ring your ears out by telling you all about his new baby project. As always, we in HR will throw him a lending hand whenever we can. Please note, interviews will be conducted by Weddings.io team and not by BusyQA.  Weddings.io is an AI-powered wedding planning platform designed to streamline and personalize the wedding planning process. Our platform is a unique blend of technological innovation and design, aimed at transforming how couples plan their special day and how vendors gain visibility. Our mission is to revolutionize the wedding industry and empower buyers and sellers with an ecosystem of AI-driven tools and intuitive, user-friendly product design.  The wedding industry represents a vast and lucrative market, with a global value exceeding roughly $200 billion and growing. However, there is a clear gap in innovative, tech-driven solutions, as couples increasingly seek personalized, efficient, and unique wedding experiences. Were looking for a CTO who sees the potential for a platform like weddings.io, and is eager to be a part of its growth as the first AI-centric wedding planning platform in the world.  **Salary: $100-120K + founding shares**  **Technology Vision and Strategy**: Develop and implement a comprehensive technology strategy that aligns with the overall business goals of weddings.io. Stay abreast of new technological trends, especially in AI and SaaS, and adapt strategies to maintain competitive advantage.  **Leadership and Team Management**: Build, lead, and mentor a high-performing technology team, including software engineers, developers, data scientists, and IT support staff. Create a collaborative and innovative work culture that fosters creativity and efficiency.  **Product Development and Management:** Oversee the entire lifecycle of product development, from ideation and design to deployment and updates. Ensure the platform's architecture is scalable, reliable, and adaptable to changing business needs.  **Quality Assurance and Risk Management:** Implement best practices in software development, ensuring high-quality product deliverables. Identify potential technological risks and develop mitigation strategies.  **Compliance and Security:** Ensure compliance with relevant legal and regulatory requirements, particularly in data protection and privacy. Oversee the security of the platform, safeguarding against cyber threats and ensuring data integrity.  **Education and Experience Required**  * You are located in Los Angeles or surrounding bay area* You are currently leading a tech team involved in Generative AI* A graduate or dropout of Computer Science from one the Ivy league schools  Note: If interested, send your resume to careers@busyqa.com. Only interested candidates will be contacted. *Quote Ref no: bqa-20240203W1*"}
{"id":176,"full_description":"Electrical Designer **Overview**    Would you like to be a part of a dynamic team of professionals that is truly passionate about our work? Are you interested in working for an organization that does meaningful work, fosters a collaborative team culture, and creates a diverse, inclusive environment where you feel like you belong? If this sounds like you, talk to us about joining our team.     Is an internationally recognized environmental engineering firm that specializes in the planning, design, and construction of water and wastewater facilities. Our vision is to become the best water consulting firm and we are looking for motivated, talented people to help us reach that goal. We are seeking an Electrical BIM Designer to support Our vision of becoming the best water consulting firm.    This is a junior BIM designer position. The position requires comprehensive proficiency in 2D CAD software and a demonstrated knowledge of 3D design capabilities. This position also requires a good understanding of engineering drawing development in the area of water and wastewater facilities design and the associated infrastructure. Job duties will also include the coordination of drawing production activities between all disciplines at the project level.    **Responsibilities**    Responsibilities include the following. Other duties may be assigned.  * Able to develop structural design layouts and drawings from sketches provided by engineers and senior design staff.* Assist in the preparation of structural specifications, estimates, and material lists with project engineers or project managers guidance.* A fundamental working knowledge of structural drawing layout, detailing, and drafting of structural solutions.* Ability to develop 2D drawing views from 3D structural models and complete detailing and annotation.* Assist in the quality checking of drafted product and conformance with drawing production standards and project specific CAD\/BIM requirements.* Working knowledge of water, wastewater, and infrastructure design.* Basic understanding of converting data between Revit and AutoCAD.  **Qualifications**    * High School Diploma or GED equivalent.* Advanced proficiency in 2D CAD using MicroStation and AutoCAD, and a demonstrated proficiency with 3D CAD\/BIM techniques using Revit Structure software applications.* Familiar with AISC weld symbols and their application.* Fundamental knowledge of 3D structural modeling for concrete, masonry, and steel structures using Revit Structure applications.* Good communication skills, both written and verbal.  **Preferred Qualifications**    * Two-year technical or Associate Degree.* 5 years of experience in engineering or related field.  **Pay Range**    $30.00 to $35.00 per hour. This is the lowest to highest salary we in good faith believe we would pay for this role at the time of this posting. We may ultimately pay more or less than the posted range, and the range may be modified in the future. An employees pay within the salary range will be based on several factors including, but limited to, relevant education, qualifications, certifications, experience, skills, seniority, geographic location, performance, and business or organizational needs.    **Other Compensation and Benefits**    We are committed to providing employees with a competitive, comprehensive benefits program that provides the care employees and their families need to lead healthy, productive lives. Our benefits package includes paid time off and holidays, comprehensive health insurance coverage, pre-tax savings account options for healthcare, dependent care and commuter expenses, disability insurance and life insurance options for you and your dependents. We also offer free Caregiver Support, Travel Assistance, counseling services and discount programs. Other compensation that may be available includes: 401(k) company contribution matching, tuition reimbursement, discretionary bonuses, career advancement bonuses, professional registration bonuses, employee referral bonuses, and compensatory time for exempt employees. Flexible work arrangements may also be available. Eligibility for benefits varies based on employment status.  Flexible work from home options available."}
{"id":668,"full_description":"Lead Software Engineer - React \/ Front End **JOB DESCRIPTION**  We have an opportunity to impact your career and provide an adventure whereyou can push the limits of what's possible.As a Lead Software Engineer - React \/ Front End at JPMorgan Chase within theConsumer and Community Banking - Home Lending Technology team, you will be anintegral part of an agile team that works to enhance, build, and delivertrusted market-leading technology products in a secure, stable, and scalableway. As a core technical contributor, you are responsible for conductingcritical technology solutions across multiple technical areas within variousbusiness functions in support of the firm's business objectives.**Job responsibilities**          * Executes creative software solutions, design, development, and technical troubleshooting with ability to think beyond routine or conventional approaches to build solutions or break down technical problems          * Develops secure high-quality production code, and reviews and debugs code written by others          * Identifies opportunities to eliminate or automate remediation of recurring issues to improve overall operational stability of software applications and systems          * Leads evaluation sessions with external vendors, startups, and internal teams to drive outcomes-oriented probing of architectural designs, technical credentials, and applicability for use within existing systems and information architecture          * Leads communities of practice across Software Engineering to drive awareness and use of new and leading-edge technologies          * Adds to team culture of diversity, equity, inclusion, and respect **Required qualifications, capabilities, and skills**          * Formal training or certification on software engineering concepts and 5+ years of applied experience          * Hands-on practical experience delivering system design, application development, testing, and operational stability          * Advanced in one or more programming language(s)          * Proficiency in automation and continuous delivery methods          * Proficient in all aspects of the Software Development Life Cycle          * Advanced understanding of agile methodologies such as CI\/CD, Applicant Resiliency, and Security          * Demonstrated proficiency in software applications and technical processes within a technical discipline (e.g., cloud, artificial intelligence, machine learning, mobile, etc.)          * In-depth knowledge of the financial services industry and their IT systems          * Practical cloud native experience          * Mentor other junior team members and exhibit ownership of the task assigned          * Experience with HTML5, CSS, OO JavaScript, JavaScript Frameworks like Angular or React on enterprise sites**Preferred qualifications, capabilities, and skills**          * Familiarity with modern front-end technologies, JS frameworks, solid understanding of Agile methodologies such as CI\/CD, application resiliency and security.          * Exposure to cloud technologies, Cypress automation, cucumber or equivalent automation framework, reporting using Kibana or equivalent reporting tool.          * Hands-on practical experience in system design, application development, testing and operational stability, using different mocking solutions to perform front end testing in isolation.          * Experience in developing, debugging, and maintaining code in an enterprise environment with one or more modern programming languages and database querying languages.**ABOUT US**  JPMorgan Chase & Co., one of the oldest financial institutions, offersinnovative financial solutions to millions of consumers, small businesses andmany of the world's most prominent corporate, institutional and governmentclients under the J.P. Morgan and Chase brands. Our history spans over 200years and today we are a leader in investment banking, consumer and smallbusiness banking, commercial banking, financial transaction processing andasset management.We offer a competitive total rewards package including base salary determinedbased on the role, experience, skill set, and location. For those in eligibleroles, we offer discretionary incentive compensation which may be awarded inrecognition of firm performance and individual achievements and contributions.We also offer a range of benefits and programs to meet employee needs, basedon eligibility. These benefits include comprehensive health care coverage, on-site health and wellness centers, a retirement savings plan, backup childcare,tuition reimbursement, mental health support, financial coaching and more.Additional details about total compensation and benefits will be providedduring the hiring process.We recognize that our people are our strength and the diverse talents theybring to our global workforce are directly linked to our success. We are anequal opportunity employer and place a high value on diversity and inclusionat our company. We do not discriminate on the basis of any protectedattribute, including race, religion, color, national origin, gender, sexualorientation, gender identity, gender expression, age, marital or veteranstatus, pregnancy or disability, or any other basis protected under applicablelaw. We also make reasonable accommodations for applicants' and employees'religious practices and beliefs, as well as mental health or physicaldisability needs. Visit our FAQs for more information about requesting anaccommodation.JPMorgan Chase is an Equal Opportunity Employer, including Disability\/Veterans      **ABOUT THE TEAM**    Our Consumer & Community Banking Group depends on innovators like you to serveconsumers, small businesses, municipalities and non-profits. You'll supportthe delivery of award winning tools and services that cover everything frompersonal and small business banking as well as lending, mortgages, creditcards, payments, auto finance and investment advice. This group is alsofocused on developing and delivering cutting edged mobile applications,digital experiences and next generation banking technology solutions to betterserve our clients and customers."}
{"id":103,"full_description":"MGR TEST INSPECTION 2 Req ID: 36929  Team: E37 WELDING AND NDT ENGINEERING  Entity: Newport News ShipbuildingUS Citizenship Required for this Position: YesFull-Time  Shift: 1st  Relocation: No relocation assistance available  Virtual\/Telework Opportunity: No - Not eligible for teleworkTravel Requirement: Yes, 10%-25% of the timeClearance Required: No - Clearance Not Required to Start  **Meet HIIs Newport News Shipbuilding**  With more than 25,000 employees – including third-, fourth- and even fifth-generation shipbuilders – HIIs Newport News Shipbuilding (NNS) division is the largest industrial employer in Virginia. Were the sole designer, builder and refueler of U.S. Navy nuclear aircraft carriers and one of two providers of U.S. Navy nuclear submarines. Our diverse and innovative team of professionals ranges from skilled trades to project managers, engineers and software developers to solution architects, technical subject matter experts, and system users. Anchored in our rich, 135-year history, we collaborate together at the forefront of technology, manufacturing, and integration of the most powerful and survivable naval ships in the world. Want to be part of the team? Apply today! We look forward to meeting you.  **The Role**Supervises employees who test and\/or inspect products to determine compliance with specifications.**Must Have**Apprentice graduate, Bachelors Degree or equivalent and 6 years of applicable technical experience. 4 years of related exempt experience can be substituted for Bachelors degree.A minimum of 2 years as a Supervisor Test Inspection 1 or equivalent position plus a minimum of 8 years related non-exempt experience can be substituted for a Bachelors degree and experience.**Nice to Have*** Hands on experience as an NDT examiner in MT\/PT or VT* Qualification in at least one NDT method such as MT, or PT per the requirements of ASTM SNT-TC1A* Experience writing NDT procedures, qualifying and testing Inspectors, performing NDT audits, performing technical performance evaluations and re-inspections supporting NuVal shipbuilding* Experience training and testing new NDT examiners\/Level III inspectors* Experience for all aspects of a NDE program for either MT\/PT or VT methods.  **Why HII**  We build the worlds most powerful, survivable naval ships and defense technology solutions that safeguard our seas, sky, land, space and cyber. HIIs diverse workforce includes skilled tradespeople; artificial intelligence, machine learning (AI\/ML) experts; engineers; technologists; scientists; logistics experts; and business administration professionals.  Recognized as one of Americas top large company employers, we are a values and ethics driven organization that puts peoples safety and well-being first. Regardless of your role or where you serve, at HII, youll find a supportive and welcoming environment, competitive benefits, and valuable educational and training programs for continual career growth at every stage of your career.  Working at HII is more than a job - its an opportunity to build a future. We offer comprehensive benefits including: medical, prescription drug, dental and vision plan choices, on-site health centers, tele-medicine, wellness resources, employee assistance programs, savings plan options (401K), financial education and planning tools, life insurance, tuition reimbursement, employee discounts, early childhood and post-secondary education scholarships, and more. Some benefits may vary depending on your specific division or work location.    **Together we are working to ensure a future where everyone can be free and thrive.**Todays challenges are bigger than ever, and the nation needs the best of us. Its why were focused on hiring, developing and nurturing our diversity. We believe that diversity among our workforce strengthens the organization, stimulates creativity, promotes the exchange of ideas and enriches the work lives of all our employees.  All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, physical or mental disability, age, or veteran status or any other basis protected by federal, state, or local law. U.S. Citizenship may be required for certain positions.    **Do You Need Assistance?**  If you need a reasonable accommodation for any part of the employment process, please send an e-mail to buildyourcareer@hii-co.com and let us know the nature of your request and your contact information. Reasonable accommodations are considered on a case-by-case basis. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address.    Additionally, you may also call **1-844-849-8463** for assistance. Press #2 for Newport News Shipbuilding."}
{"id":532,"full_description":"Capital Markets Data Science Manager (Hybrid) **Company Description**  At Fannie Mae, futures are made. The inspiring work we do helps make a home a possibility for millions of homeowners and renters. Every day offers compelling opportunities to use tech to tackle housings biggest challenges and impact the future of the industry. Youll be a part of an expert team thriving in an energizing, flexible environment. Here, you will grow your career and help create access to fair, affordable housing finance. **Job Description**  As a valued leader on the team, you will manage a team who produce insights, new product or change recommendations, process improvement or automation, and predictive modeling for parts of projects, programs, or products. You will develop the team's skills in data mining and data analysis methods, large data processing techniques, and computational programing capabilities, as well as problem-solving and communication skills. In this role, you will manage the coordination with the data engineering and data management teams, and external or created data sources to apply data mining techniques in preparation for analysis or use of enterprise data assets.    **THE IMPACT YOU WILL MAKE**  The Capital Markets Data Science Manager (Hybrid) role will offer you the flexibility to make each day your own, while working alongside people who care so that you can deliver on the following responsibilities:* Coordinate team activities with product and\/or business owners, data engineers, and platform teams to understand business needs and current capabilities, data availability, and alternative uses to drive success of parts of projects, programs, or products.* Ensure application of statistical modeling capabilities from disciplines, such as computer science, computational science and methods, statistics, econometrics, data optimization, and data visualization.* Build predictive analytic capabilities within the team to enhance the delivery of business applications, and support the integration of data and statistical models or algorithms. Apply innovative industry practices in research and testing to product development, deployment, and maintenance.* Oversee the design and build of new modeling applications to support risk measurement, financial valuation, decision making, and business performance for parts of products or initiatives.* Ensure the team communicates complex ideas and solutions effectively to business partners through data visualizations, technical documentation, and non-technical presentation materials.* Coordinate a team to provide tactical insights to the Capital Markets teams quickly through expertise in Fannie Mae's huge public and proprietary databases* Develop statistical and predictive models to inform new policies and decision making* Work with junior members of the team directly to help develop their technical and analytical skills* Build shared understanding with our partners in Capital Markets, help identify pain points in their work, and build solutions that alleviate those pain points* Uphold high standards for quality and accuracy in analytic  **Qualifications** **THE EXPERIENCE YOU BRING TO THE TEAM**    **Minimum Required Experiences*** 6 yearsSkills* Skilled in presenting information and\/or ideas to an audience in a way that is engaging and easy to understand* Experience gathering accurate information to explain concepts and answer critical questions* Skilled in the graphical representation of information in the form of a charts, diagrams, pictures, and dashboards with programs and tools such as Excel, Tableau, or Power BI* Experience helping an organization to plan and manage change in effort to meet strategic objectives* Experience in the process of analyzing data to identify trends or relationships to inform conclusions about the data* Communication including communicating in writing or verbally, copywriting, planning and distributing communication, etc.* Determining causes of operating errors and taking corrective action* Programming including coding, debugging, and using relevant programming languages* Adept at managing project plans, resources, and people to ensure successful project completion* Collective capabilities for leadership, including leading teams, giving feedback, facilitating meetings, and coaching and mentoring* Experience defining and managing changes to documents, code, computer programs, websites, and other files to enable collaboration and ensure teams are working from the latest version* Expertise in using statistical methods, including: developing and testing hypotheses, using experimental design, and running linear and logistic regressions* Product Development including designing products, developing product roadmaps, translating design requirements, prototyping, etc.* Influencing including negotiating, persuading others, facilitating meetings, and resolving conflict* Ability to frame ideas as systems and analyzing the inputs, outputs, and process* Experience evaluating businesses, projects, budgets, and other financial entities or instruments to determine viability, stability, and performanceTools* Skilled in using Bloomberg Professional* Skilled in SQL* Skilled in Tableau* Skilled in using Intex* Skilled in RStudio to develop programs in R* Experience using APIs for developing or programming software* Skilled in R Language Programming* Experience using BitBucket* Skilled in DBeaver SQL client software* Skilled in R Markdown* Experience using JIRA **Desired Experiences*** Bachelor degree or equivalent* 6 years of relevant experience* **Leadership Skills**+ Ability to direct and evaluate the more technical aspects of data analysis and research, while also managing team in a timely manner to focus on the broader context and key impacts of the analysis+ Strong written and verbal communication skills+ Relationship management including managing and engaging stakeholders, partners, customers, and building relationship networks* **Technical Skills**+ Strong analytical and problem-solving skills to conduct and manage analysis to address complex business problems+ Programming including coding, debugging, and using relevant languages such as Python, R, SQL, or similar+ Experience in the process of analyzing data to identify trends or relationships to generate business insights and inform conclusions about the data+ Expertise in visualizing data to identify, summarize and explain observed data patterns+ Experience with Version Control Software* Experience helping an organization to plan and manage change in effort to meet strategic objectives* Management experience including leading teams, giving feedback, facilitating meetings, and coaching and mentoring* Skilled in cloud technologies and cloud computing* Experience defining and managing changes to documents, code, computer programs, websites, and other files to enable collaboration and ensure teams are working from the latest version* Skilled in presenting information and\/or ideas to an audience in a way that is engaging and easy to understand using graphical representation of information in the form of a charts, diagrams, pictures, and dashboards with programs and tools such as Excel, Tableau, R Shiny or similar* Expertise in using statistical methods, including: developing and testing hypotheses, using experimental design, and running linear and logistic regressions  **Additional Information**  The future is what you make it to be. Discover compelling opportunities at careers.fanniemae.com.    Fannie Mae is an Equal Opportunity Employer, which means we are committed to fostering a diverse and inclusive workplace. All qualified applicants will receive consideration for employment without regard to race, religion, national origin, gender, gender identity, sexual orientation, personal appearance, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation in the application process, email us at careers_mailbox@fanniemae.com.  The hiring range for this role is set forth on each of our job postings located on Fannie Mae's Career Site. Final salaries will generally vary within that range based on factors that include but are not limited to, skill set, depth of experience, certifications, and other relevant qualifications. This position is eligible to participate in a Fannie Mae incentive program (subject to the terms of the program). As part of our comprehensive benefits package, Fannie Mae offers a broad range of Health, Life, Voluntary Lifestyle, and other benefits and perks that enhance an employees physical, mental, emotional, and financial well-being. See more here."}
{"id":187,"full_description":"Integration Architect Overview:As an **Integration Architect**, you will work with our growing DevSecOps practice developing APIs and integration capabilities to connect data, services, and systems to help our customers achieve their mission. We are looking for candidates with experience building APIs and microservices with cloud platform services, understanding business requirements and implementing complex integrations for data and services. You will act as both technical visionary and be responsible for hands-on delivery.Contributions:**Responsibilities include:*** Understanding the needs of stakeholders and conveying this to developers* Testing and examining code written by others and analyzing results* Ensure that systems are safe and secure against cybersecurity threats* Identify technical problems, perform root cause analysis, and develop software updates and ‘fixes* Develop APIs, micro-services and integrations using a broad range of software programming tasks to ensure that their systems integrations are functional.* Design reusable assets, components, standards, frameworks, and processes to support and facilitate API and integration projects.* Advise technical teams on performance, scalability, reliability, monitoring, and other operational concerns of integration solutions.* Work with technical and non-technical stakeholders to translate functional and non-functional requirements into integration interfaces and implementations* Create and provide technical documentation that explains upcoming or existing integrations to non-technical individuals* Document as-is state of the environment, perform a gap analysis, and produce artifacts that articulate options and recommendations* Act as an individual contributor and mentor more junior team members* Engineer and implement solutions and provide recommendations for continuous improvement for the services provided* Present regular status updates and provide cross training to other team members.Qualifications:**Required:*** Ability to obtain a U.S. government public trust clearance* BS Degree in an IT field OR BS in a non-IT field and 2 years related IT experience* 8 Years of Experience with one or more clouds (i.e. AWS, Azure, or GCP)* 8 Years of Experience with Git SCM providers such as GitHub, GitLab, Bitbucket* 8 Years of Experience with one or more programming or scripting languages* 8 Years of Experience with one or more integration technologies, such as Mulesoft* Experience developing API Management solutions and micro-services**Preferred:*** MS Degree in an IT-related field* Certifications:* AWS Solution Architect Professional* Azure Developer Associate* MuleSoft Certified Integration Architect - Level 1* MuleSoft Certified Platform Architect - Level 1* 5 Years of application development experience in an Agile environment* Experience implementing docker containers and utilizing platforms such as Kubernetes* Experience designing, implementing, and documenting APIs* Experience utilizing CI\/CD pipelines with tools such as Jenkins, GitLab CI\/CD, GitHub Pipelines, CircleCI, TravisCI* Experience implementing Automated Testing frameworks to test APIs and integrations* Excellent written and verbal communication skills, interpersonal and collaborative skillsAbout **steampunk**:Steampunk is a **Change Agent** in the Federal contracting industry, bringing new thinking to clients in the Homeland, Federal Civilian, Health and DoD sectors. Through our **Human-Centered delivery methodology**, we are fundamentally changing the expectations our Federal clients have for true shared accountability in solving their toughest mission challenges. As an **employee owned company**, we focus on investing in our employees to enable them to do the greatest work of their careers – and rewarding them for outstanding contributions to our growth. If you want to learn more about our story, visit http:\/\/www.steampunk.com. *We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. Steampunk participates in the E-Verify program.*"}
{"id":662,"full_description":"Lead C# .Net Full Stack Developer\/Architect **A Healthcare Technology company based in Irving, TX is looking for C#Lead\/Architect with following required skills:**          * 10+ years of C# .Net development experience along with understanding of various frameworks & 3rd party APIs          * Advanced knowledge of MVC, WebAPI, Entity Framework, .NET Core, and other related Microsoft Technologies including Visual Studio          * Experience with JavaScript libraries and frameworks such as Angular, React, or Vue          * 3-5 years domain knowledge of healthcare data standards such as HL7, FHIR, EDI X12          * Strong HTML\/CSS\/JavaScript, JSON, and jQuery programming skills          * Strong understanding of Azure DevOps Git, Builds & Releases          * Prior experience with managing & setting up Microsoft Azure artifacts including but not limited to, Web Apps, Data Factory, Storage, Redis, Managed Instance, Virtual Machines & Active Directory          * Strong understanding of object-oriented programming & popular design patterns          * Strong understanding of SQL development concepts (Stored Procs, SQL Functions, Joins, SSRS Reporting & IDE use)          * Experience with BizTalk Server and understanding with EDI, XML, x12, and API implementations is a plus **Your day to day job responsibilities will include but not limited to:**          * Responsible for guiding all development phases, including database and application code, ensuring adherence to quality standards and the execution of test plans.          * Spearhead R&D endeavors to create secure, scalable, and highly available software solutions, from inception through deployment and ongoing maintenance.          * Partner closely with Product Management to ensure engineering efforts are aligned with business requirements and effectively fulfill design objectives.          * Produce and maintain technical design documentation that meets the standards of both business and solution architecture needs.          * Collaborate with technology leadership to identify and implement cutting-edge technologies and methodologies, aiming to enhance platform performance and elevate the customer experience.          * Offer technical support across relational databases, SQL, and application logic, including the development of APIs to streamline data management and modeling processes.          * Work closely with peers in architecture and engineering to deliver comprehensive solutions that are not only high-performing and reliable but also scalable and easily operable.          * Local candidates onlyJob Types: Full-time, Temp-to-hirePay: $70.00 - $90.00 per hourExpected hours: 40 per weekBenefits:          * Dental insurance          * Flexible schedule          * Health insurance          * Paid time off          * Vision insuranceCompensation package:          * Hourly payExperience level:          * 10 yearsSchedule:          * Monday to FridayApplication Question(s):          * We require employees to work in office 3 days a week (Monday, Tuesday, Thursday) and work from home 2 days a week (Wednesday, Friday). We also expect that a new employee will working in office every day for the first month. Will you be able to meet this schedule?          * This position is 3 months contract to hire if you demonstrate required skills and willingness to perform in high stake environment.Education:          * Bachelor's (Preferred)Experience:          * MVC: 5 years (Required)          * C#: 5 years (Required)          * Azure: 3 years (Required)Ability to Relocate:          * Irving, TX 75038: Relocate before starting work (Required)Work Location: Hybrid remote in Irving, TX 75038"}
{"id":656,"full_description":"Vice President of Finance Midwest multi-disciplined engineering firm is looking to add a Vice President of Finance to their Chicago-suburb team!      Responsibilities:  * Aid company in meeting strategic objectives and growth initiatives through the development\/execution of financial strategies* Provide leadership to department heads to establish financial targets\/performance measurements for the annual budgeting and forecasting process* Conduct financial analysis\/performance assessments on a monthly\/quarterly basis to identify opportunities for cost optimization, revenue enhancement, and risk mitigation* Responsible for timely\/accurate financial reporting for vice presidents, board of directors, and other stakeholders* Mentor\/train junior staff and provide opportunities for professional development* Responsible for all accounting operations (cash flow management, accounts payable, accounts receivable, general ledger, and month-end close processes)* Ensure compliance with regulatory requirements, accounting standards, and internal controls* Manage relationships with all outside vendors (auditors, tax advisors, banking partners, insurance companies, etc.)* Support strategic investments\/business initiatives through monitoring cash flow, liquidity, and capital allocation* Oversee administration of companys 401(k) plan and stock program and ensure compliance with all laws, regulations, and company policies* Assist with mergers\/acquisitions  Requirements:  * Bachelors degree in Finance, Accounting or related field* CPA preferred* 15+ of proven success in a financial leadership role* Experience working in the Architect\/Engineering Industry preferred* Extensive knowledge of financial principles, practices, and regulations (including reporting requirements)* Strong analytical skills, strategic thinking ability, communication skills, and leadership experience* Ability to dive into details while maintaining a big-picture perspective through a hands-on approach* Proficient in financial modeling, forecasting, and budgeting software* Experience using project management systems (Vantagepoint) preferred* Requires a commitment to upholding the highest standards of financial integrity\/corporate governance    Salary is commensurate with experience.     Successful applicant must be authorized to work in the USA without sponsorship.     *All qualified applicants will receive consideration for employment without regard to protected veteran status, disability, race, color, religion, sex, sexual orientation, gender identity, or national origin.*     Please contact Laura Harrison for further information!     www.harrisonconsultingsolutions.com     517-906-6926"}
{"id":462,"full_description":"IT Specialist (DATAMGT) **Duties**----------**As a IT Specialist (DATAMGT) your duties will include but are not limited to the following:*** Provides leadership for data management efforts at the Ecological Services (ES) headquarters level and coordinates all data management activities with the national data management initiative.* Facilitates staff compliance with the Service's Data Management Policy, Open Data policies and any additional programmatic data management goals.* Works closely with program leaders in Ecological Services, Refuges, Migratory Bird Management, and Fisheries and Aquatic Conversation , to ensure that data management efforts adhere to National Data Management Policies, national efforts and meet ECOSphere data management needs.* In accordance with IRTM governance policy and oversight of the Chief, Division of Data Integration, this position serves as a systems analyst expert and conducts needs analysis to determine system requirements and specifications for designing, maintaining and improving existing and new applications and complex databases that bridge multiple workspaces (i.e. programs). Works with *other* Data Managers, users as well as others involved in the formulation of user requirements that will result in modifications and\/or development of data management systems.* Provides insight into the needs of data storage structures, data catalogs, and related applications and ensures existing data repositories are accurate and up-to-date and in accordance with IRTM governance policy. Completes related processes and analyses, including extract, transform, load (ETL) procedures, database queries, and version control procedures.* Serves as the technical data lead for ECOSphere and programmatic data management and provides recommendations to the Branch or Division Chief on technical concerns. In addition takes the final decisions and works with the other Regional Data Managers, Data Technicians and other staff and contractors who are responsible for implementing data management policy and guidance within ECOSphere.Salary Table 2024-DEN includes Fort Collins, CO  Salary Table 2024-DCB - Washington DC Metro Area  **Requirements**----------------### **Conditions of Employment*** Must be a U.S. Citizen or National.* Resume (See \"Required Documents\"). Failure to provide ALL required information on your resume will result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all information is provided on resume.* Eligibility and Supporting documents - You will ONLY be considered for the eligibilities that you select \"yes\" to AND submit the required supporting documentation, as listed in the Required Documents section.* Suitability for employment, as determined by background investigation* Driver's License: Selectees MAY be required to possess and maintain a valid State driver's license at all times during their tenure.* Probationary Period: Selectees may be required to successfully complete a probationary period.* Individuals assigned male at birth after 12-31-59 must be registered for Selective Service. To verify registration visit SSS.gov.### **Qualifications****Only experience and education obtained by 03\/22\/2024 will be considered.**    **In order to qualify for this position, you must possess both the** **Basic Requirement** **and** **Minimum Qualification.**    **Experience** - Experience must be IT related; the experience may be demonstrated by paid or unpaid experience and\/or completion of specific, intensive training (for example, IT certification), as appropriate. For all positions individuals must have IT-related experience demonstrating each of the four competencies listed below. The employing agency is responsible for identifying the specific level of proficiency required for each competency at each grade level based on the requirements of the position being filled.* **Attention to Detail** - Is thorough when performing work and conscientious about attending to detail.* **Customer Service** - Works with clients and customers (that is, any individuals who use or receive the services or products that your work unit produces, including the general public, individuals who work in the agency, other agencies, or organizations outside the Government) to assess their needs, provide information or assistance, resolve their problems, or satisfy their expectations; knows about available products and services; is committed to providing quality products and services.* **Oral Communication** - Expresses information (for example, ideas or facts) to individuals or groups effectively, taking into account the audience and nature of the information (for example, technical, sensitive, controversial); makes clear and convincing oral presentations; listens to others, attends to nonverbal cues, and responds appropriately.* **Problem Solving** - Identifies problems; determines accuracy and relevance of information; uses sound judgment to generate and evaluate alternatives, and to make recommendations.**Minimum Qualifications for the 13-grade level:** 1 year of specialized experience, equivalent to at least the GS-12 grade level in the Federal service. Examples of Specialized experience may include: (1) Performing data and application analysis to ensure overall database management projects goals are met and are used to help inform conservation efforts; (2) Using programming language appropriate to natural resource software to create live reports that summarize natural resource data as it is added to software; (3) Integrating data in data warehouse, creating data marts and integrating with specialized software; (4) Programming and\/or coding SQL based software; (5) Performing integrations of software with cloud applications; (6) Containerize and pipeline development; (7) Using programming languages such as SQL, R, JavaScript, Python, and web services such as REST, XML, and JSON to support natural resource management; (8) Collaborating with internal and external customers, data management analysts, data managers, developers, and program managers to identify and specify new or improved data management processing solutions that will bridge multiple workspaces (i.e., programs) in the field of conservation and\/or natural resources; (9) Providing guidance and instruction to personnel regarding new directives on assigned data management projects and their requirements; (10) Applying data management concepts, principles, and methods to design, develop, and maintain data management systems that meet business requirements for natural resource management.    Experience refers to paid and unpaid experience, including volunteer work done through National Service programs (e.g., Peace Corps, AmeriCorps) and other organizations (e.g., professional; philanthropic; religious; spiritual; community, student, social). Volunteer work helps build critical competencies, knowledge, and skills and can provide valuable training and experience that translates directly to paid employment. You will receive credit for all qualifying experience, including volunteer experience.### **Education****N\/A**### **Additional information**    **PCS INFORMATION:**  Yes, entitlements for payment of basic moving expenses, as required and to the extent allowed by the Federal Travel Regulation (FTR) 302-3.101, are authorized for eligible applicants changing duty station when the change meets the distance tests as provided in FTR 302-1.1 and 302-2.6. All moving expenses are taxable. In addition, relocation discretionary entitlements MAY be authorized for this position **including** contractor-provided home sale.    **TELEWORK:**  This position is suitable for telework and may be allowed to telework with supervisory approval.**Career Transition Assistance Plan (CTAP) or Interagency Career Transition Assistance Plan (ICTAP):**Department of Interior (DOI) Career Transition Assistance Plan (CTAP) procedures apply in filling this vacancy. CTAP\/ICTAP provides placement assistance to permanent Federal employees who are surplus, displaced, or involuntarily separated. Applicants claiming CTAP\/ICTAP eligibility must submit a copy of their most recent performance appraisal, proof of eligibility, and most current SF-50 noting position, grade level, and duty location with their application. To be considered under CTAP\/ICTAP, applicants must be well-qualified (i.e., meet the minimum qualification requirements, including any selective placement factors; education, and experience requirements), score at least 85 on the assessment questionnaire, and be able to perform the duties of the position upon entry. For information on CTAP and ICTAP click here    **Reasonable Accommodation:** The USFWS provides reasonable accommodations to applicants with disabilities. Please visit **USAJOBS Help Center | Reasonable accommodation policy** if you need a reasonable accommodation for any part of the application and hiring process.    Applicants who apply under this job opportunity announcement agree to have their application, associated documents and applicable personal information shared with other Bureaus\/Offices within the Department of the Interior (DOI) who have vacancies within the same occupational series, grade, full performance level and in the same geographic location(s), including within the same metro\/commuting area. Applying to this announcement does not replace the need to apply to other job opportunity announcements for which you wish to receive consideration.  * BenefitsA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.Review our benefitsEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.**How You Will Be Evaluated**-----------------------------You will be evaluated for this job based on how well you meet the qualifications above.You will be evaluated based on how well you meet the qualifications listed in this vacancy announcement. Your qualifications will be evaluated based on your application materials (e.g., resume, supporting documents), your responses on the application questionnaire, and your responses to all assessments required for this position. You will be assessed on the following competencies (knowledge, skills, abilities, and other characteristics):Accountability  Attention to Detail  Customer Service  Decision Making  Flexibility  Influencing\/Negotiating  Integrity\/Honesty  Interpersonal Skills  Learning  Reading  Reasoning  Self-Management  Stress Tolerance  Teamwork* Knowledge of data management concepts, principles and methods sufficient to design, develop, and maintain data management systems that meet current and future business requirements for natural resource management.* Communication skills, including technical writing skills and the ability to communicate accurately and concisely.* Skills in common programming languages such as SQL, R, JavaScript, Python, and web services such as REST, XML, and JSON for application development.* Skill and expertise in developing workflow processes and data management systems to support natural resource management.Overstating your qualifications and\/or experience in your application materials or application questionnaire may result in your removal from consideration. Cheating on an assessment may also result in your removal from consideration.    In order to be considered for this position, you must complete all required steps in the process. In addition to the application and application questionnaire, this position requires an online assessment. The online assessment measures critical general competencies required to perform the job.    Overstating your qualifications and\/or experience in your application materials or application questionnaire may result in your removal from consideration. Cheating on the online assessment may also result in your removal from consideration. Please follow all instructions carefully when applying, errors or omissions may affect your eligibility.    All qualified candidates will be assigned to a quality category. The category assignment is a measure of the degree in which your background matches the competencies required for this position. The category ratings for this position are: Best Qualified, Well Qualified, and Qualified    The category rating process protects the rights of veterans by placing them ahead of non-preference eligibles within each quality category. Veterans' preference eligibles who meet the qualification requirements and who have a compensable service-connected disability of at least 10 percent will be listed in the highest quality category (except in the case of scientific or professional positions at the GS-09 level or higher).    To preview the application questionnaire, click the following link:https:\/\/apply.usastaffing.gov\/ViewQuestionnaire\/12346934* BenefitsA career with the U.S. government provides employees with a comprehensive benefits package. As a federal employee, you and your family will have access to a range of benefits that are designed to make your federal career very rewarding. Opens in a new windowLearn more about federal benefits.Review our benefitsEligibility for benefits depends on the type of position you hold and whether your position is full-time, part-time or intermittent. Contact the hiring agency for more information on the specific benefits offered.* Required DocumentsAs a new or existing federal employee, you and your family may have access to a range of benefits. Your benefits depend on the type of position you have - whether you're a permanent, part-time, temporary or an intermittent employee. You may be eligible for the following benefits, however, check with your agency to make sure you're eligible under their policies.You must submit a complete application package. We will not make assumptions about your experience and\/or education.    **Required Documents:**    **1. Resume:** You are highly encouraged to use USAJOBS Resume Builder to ensure all required information is included in your Resume. If you use your own resume, curriculum vitae, or any other written form you choose then you must describe your job-related qualifications that includes beginning and ending dates for paid and non-paid work experience, **hours worked per week,** month and year of employment for each job title listed, and description of job duties. Include name and address of employer; supervisor name and telephone number. Additional information on what to include can be found here. **Your experience needs to address every required qualification. Note: Failure to provide ALL required information on your resume will result in loss of consideration due to an incomplete application package.**      **Additional Documentation, if applicable:**  **1. Cover Letter**    **2. Veterans' Preference Documentation:** If you are a veteran with preference eligibility and you are claiming 5-point veterans' preference, you must attach a copy of your **DD-214 Member Copy 2 or 4** showing you were honorably discharged. If you are claiming 10-point veterans' preference, attach an SF-15, Application for 10-Point Veterans' Preference in addition to the proof required by that form (i.e. VA letter). **You may not be awarded preference if you do not attach the correct Veteran Documentation as specified above.**    **3. CTAP\/ICTAP Documentation:** If you are applying under CTAP or ICTAP, you MUST submit proof of eligibility under 5 CFR 330.602(a) for CTAP and 5 CFR 330.704 for ICTAP. This includes a copy of the agency notice, a copy of your most recent performance rating, and a copy of your most recent SF-50 (Notification of Personnel Action) showing your position, grade level, and duty location. Please annotate your application to reflect that you are applying as a CTAP or ICTAP eligible.    **4. College Transcripts:** Please refer to the education section above for additional information. Unofficial transcripts are acceptable. A copy of your official transcripts may be required if you are selected.    **Failure to submit any of the above-mentioned required documents will result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all required documents have been submitted**#### **If you are relying on your education to meet qualification requirements:**Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and\/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.* How to ApplyPlease read the entire announcement and all the instructions before you begin an application. To apply and be considered for this position, you must complete all required questionnaires, assessments and submit all required documentation as specified in the How to Apply and Required Documents section. The complete application package must be submitted by 11:59 PM (ET) on the closing date of the announcement to receive consideration.    Review the appointment eligibility criteria in the application preview linked below. The eligibility section of the application allows you to choose how you wish to be considered for this vacancy announcement. **You will ONLY be considered for the eligibilities that you select \"yes\" to and submit the required supporting documentation, as listed in the Required Documents section or the application text.** The application process is as follows:1. Click the Apply Online button.  2. Answer the questions presented in the application and attach all necessary supporting documentation.  3. Click the Submit Application button prior to 11:59 PM (ET) on the announcement closing date.  4. If you are required to complete any USA Hire Assessments, you will be notified after submitting your application. The notification will be provided in your application submission screen and via email. The notification will include your unique assessment access link to the USA Hire system and the completion deadline. Additionally, in USAJOBS you can click \"Track this application\" to return to your assessment completion notice.  5. Access USA Hire using your unique assessment link. Access is granted through your USAJOBS login credentials.  6. Review all instructions prior to beginning your assessments. You will have the opportunity to request a testing accommodation before beginning the assessments should you have a disability covered under the Rehabilitation Act of 1973 as amended.  7. Set aside at least 3 hours to take the USA Hire Assessments; however, most applicants complete the assessments in less time. If you need to stop the assessments and continue later, you can re-use your unique assessment link.  8. Your responses to the USA Hire Assessments will be reused for one year (in most cases) from the date you complete an assessment. If future applications you submit require completion of the same assessments, your responses will be automatically reused.    For more general information, system requirements, reasonable accommodation information, and to request assistance regarding the USA Hire Assessments, review the following resources: https:\/\/help.usastaffing.gov\/Apply\/index.php?title=USA_Hire_Assessments    To update your application, including supporting documentation: During the announcement open period, return to your USAJOBS account, find your application record, and click Edit my application. This option will no longer be available once the announcement has closed.    To view the announcement status or your application status: Click on this: https:\/\/www.usajobs.gov\/Help\/howto\/application\/status\/. Your application status page is where you can view your application status, USA Hire assessment completion status, and review your notifications sent by the hiring agency regarding your application.### **Agency contact information**### **Human Resources Staffing Division**##### **Phone**000-000-0000##### **Email**fwshiring@fws.gov##### **Address***Division of Human Resources*  *Division of Human Resources*  *5275 Leesburg Pike, MS-BPHC*  *Falls Church, VA 22041*  *US*### **Next steps**Based on your application and your responses to the application questionnaire, you may be presented with instructions on how to access the USA Hire system to complete the online assessments. The online assessments must be completed within 48 hours following the close of this announcement. You will have the opportunity to request a testing accommodation for the assessment should you have a disability covered under the Rehabilitation Act of 1973 as amended.    Your assessment results will be kept on record for one year and used toward future positions for which you might apply that require the same assessments.    To be considered for the position, you must meet all qualifications, including meeting or exceeding the cut score on the required assessments.    Once you submit all the required documents and the online application in USAJOBS, you will receive an acknowledgement email that your submission was successful. After the evaluation process is complete, you will be notified of your status and\/or referral to the hiring official. If further evaluation or interviews are required, you will be contacted by the hiring official.    You will be notified if this job is filled or canceled. Timelines for this process vary widely.    **You may check the status of your application at any time by logging in to your USAJOBS account as we will not be responding to inquiries about the status of applications as long as the system has been updated.*** Fair and TransparentThe Federal hiring process is set up to be fair and transparent. Please read the following guidance.+ Equal Employment Opportunity (EEO) Policy+ Reasonable accommodation policy+ Financial suitability+ Selective Service+ New employee probationary period+ Signature and false statements+ Privacy Act+ Social security number request**Required Documents**----------------------You must submit a complete application package. We will not make assumptions about your experience and\/or education.    **Required Documents:**    **1. Resume:** You are highly encouraged to use USAJOBS Resume Builder to ensure all required information is included in your Resume. If you use your own resume, curriculum vitae, or any other written form you choose then you must describe your job-related qualifications that includes beginning and ending dates for paid and non-paid work experience, **hours worked per week,** month and year of employment for each job title listed, and description of job duties. Include name and address of employer; supervisor name and telephone number. Additional information on what to include can be found here. **Your experience needs to address every required qualification. Note: Failure to provide ALL required information on your resume will result in loss of consideration due to an incomplete application package.**      **Additional Documentation, if applicable:**  **1. Cover Letter**    **2. Veterans' Preference Documentation:** If you are a veteran with preference eligibility and you are claiming 5-point veterans' preference, you must attach a copy of your **DD-214 Member Copy 2 or 4** showing you were honorably discharged. If you are claiming 10-point veterans' preference, attach an SF-15, Application for 10-Point Veterans' Preference in addition to the proof required by that form (i.e. VA letter). **You may not be awarded preference if you do not attach the correct Veteran Documentation as specified above.**    **3. CTAP\/ICTAP Documentation:** If you are applying under CTAP or ICTAP, you MUST submit proof of eligibility under 5 CFR 330.602(a) for CTAP and 5 CFR 330.704 for ICTAP. This includes a copy of the agency notice, a copy of your most recent performance rating, and a copy of your most recent SF-50 (Notification of Personnel Action) showing your position, grade level, and duty location. Please annotate your application to reflect that you are applying as a CTAP or ICTAP eligible.    **4. College Transcripts:** Please refer to the education section above for additional information. Unofficial transcripts are acceptable. A copy of your official transcripts may be required if you are selected.    **Failure to submit any of the above-mentioned required documents will result in loss of consideration due to an incomplete application package. It is your responsibility to ensure all required documents have been submitted**#### **If you are relying on your education to meet qualification requirements:**Education must be accredited by an accrediting institution recognized by the U.S. Department of Education in order for it to be credited towards qualifications. Therefore, provide only the attendance and\/or degrees from schools accredited by accrediting institutions recognized by the U.S. Department of Education.Failure to provide all of the required information as stated in this vacancy announcement may result in an ineligible rating or may affect the overall rating.  Help**This job is open to**-----------------------* #### **Career transition (CTAP, ICTAP, RPL)**Federal employees who meet the definition of a \"surplus\" or \"displaced\" employee.* #### **The public**U.S. Citizens, Nationals or those who owe allegiance to the U.S.#### **Clarification from the agency**Open to all U.S. Citizens. ICTAP\/CTAP eligibles."}
{"id":32,"full_description":"Integration Layer Data Engineer **Secure our Nation, Ignite your Future**Become an integral part of a diverse team while working at an industry leading organization, where our employees come first. At ManTech International Corporation, youll help protect our national security while working on innovative projects that offer opportunities for advancement.We are seeking a motivated, career and team-oriented cybersecurity **Integration Layer** **Data Engineer** in support of the U.S. Department of Homeland Security (DHS) Cybersecurity and Infrastructure Security Agency (CISA) Continuous Diagnostic & Mitigation (CDM) Data Services Program. The CDM Data Services Program is a critical component of CISAs national effort to ensure the defense and resilience of cyberspace. This is a remote position where the candidate can work from any location within the United States provided, they are able to work on an eastern time zone schedule.The CDM Data Services Program mission is to provide a standardized platform to collect, transform, and integrate cybersecurity data from relevant authoritative data sources into a coherent data, delivering actionable information into Agency and Federal Dashboards to identify risk areas in support of mitigation as well as to facilitate coordinated agency and national response to cyber-threats.Our **Integration Layer Data Engineering** and Quality team guides and verifies data transformations so that our automated solution delivers end-to-end results with confidence. The solution is managed in cloud environments and the team works closely with developers to create an automated continuous integration (CI) and continuous delivery (CD) solutions using Agile delivery methodologies.**Responsibilities*** Work with internal and external stakeholders to examine contractual data requirements in order to drive data modeling, pipelines, transformation, normalization, and quality for each solution release through a SAFe Agile Release Train (ART) to achieve business goals* Act as subject matter expert regarding data requirements, formats, types, lineage, and quality to brief internal and external stakeholders* Analyze raw data from different sources and define consistent and machine-readable formats for the data store* Work with stakeholders to track and obtain nonautomated data sources to maintain freshness* Develop, document, and communicate processes for seamless data ETL (extraction, transformation, and loading) through Cloud based data services* In charge of directing developers on how to join and convert raw data from multiple sources into usable information for analytics and reporting* Work collaboratively with cross-functional teams to design, implement, and maintain a scalable and secure data repository\/lake that can support analyzing trends and patterns* Prepare options, levels of effort, and estimates when data requirements change* Develop database objects and schemas that support extracting, transforming, loading, and storage of data based on a logical data model (LDM)* Participate in Agile ceremonies and track and document work in Jira and Confluence* Ensure data integrity, quality, and accessibility within the repository\/lake* Conduct complex data analysis using SQL based searches and instruct developers on how to handle data quality issues* Explore and implement ways to enhance data quality and reliability and use tools to develop analytical dashboards* Work with Data Scientists to improve the quality and accuracy of the information enabling stakeholders to make more responsible cyber risk decisions* Prepare and maintain datasets for testing and modeling* Develop and maintain the solutions data dictionary and data lineage* Define data retentions and governance for the solution**Position Requirements*** Degree in Computer Science, IT, or similar field* A minimum of 5 years of proven experience as a Data Engineer or similar role* Solid understanding of relational databases and ETL processes* Proficiency in data transformation, normalization, and configuration* Technical expertise in data ingestion and manipulation* Knowledge of big data platforms and data source formats from APIs (JSON, csv, yaml)* Familiarity with API integration and data pipelines* Experience in creating dashboards (e.g., Tableau, PowerBI, or similar) for data visualization* Experience with data abstraction, various data conditions including blank and NULL data, and detecting and handling data collisions, and filtering logic syntax* Experience with SQL\/T-SQL, NoSQL, and data visualization tools design* Familiarity with data segmentation, cleansing, enrichment, and indexing* Familiarity with application administration, configuration, and integration* Experience with data security and segregation physically or logically. Know the use of role-based access and attribute-based access when limiting data.* Ability to independently perform research on industry standards, regulatory requirements, and cutting-edge technological trends. Have passion for new technologies, software, and processes* Familiarity with agile development methodologies; expertise in the Microsoft Office \/ Google suite of software**Desired Qualifications*** Data engineering or data analyst certification* Scaled Agile Framework (SAFe) certification* Experience with Data Lakes, Data Warehouses, or Data Lakehouse* Experience with data governance tools* Experience with cloud services such as Azure, AWS or GCP* Understanding of cybersecurity tools such as vulnerability (CVE) scanners, software scanners, mobile and network host discovery scanners, and other tools in order to understand source data* Familiarity with federal cybersecurity concepts such as Vulnerabilities, DISA STIGs, NIST, FISMA, Risk Management Framework, and MITRE ATT&CK Framework* Experience working in government contracting* Knowledge of programming languages (e.g., Python, PowerShell)* Experience with data compression, data deduplication.* Experience with Elasticsearch with Kibana Dashboards.404**Security\/Clearance Requirements*** Must be a US citizen and pass a background investigation.* Able to obtain and maintain a DHS Suitability\/Entry on Duty (EOD)**Physical Requirements*** Must be able to remain in a stationary position 50%* Constantly operates a computer and other office productivity machinery, such as a calculator, copy machine and computer printer.* The person in this position frequently communicates with co-workers, management and customers, which may involve delivering presentations. Must be able to exchange accurate information in these situationsFor all positions requiring access to technology\/software source code that is subject to export control laws, employment with the company is contingent on either verifying U.S.-person status or obtaining any necessary license. The applicant will be required to answer certain questions for export control purposes, and that information will be reviewed by compliance personnel to ensure compliance with federal law. ManTech may choose not to apply for a license for such individuals whose access to export-controlled technology or software source code may require authorization and may decline to proceed with an applicant on that basis alone.ManTech International Corporation, as well as its subsidiaries proactively fulfills its role as an equal opportunity employer. We do not discriminate against any employee or applicant for employment because of race, color, sex, religion, age, sexual orientation, gender identity and expression, national origin, marital status, physical or mental disability, status as a Disabled Veteran, Recently Separated Veteran, Active Duty Wartime or Campaign Badge Veteran, Armed Forces Services Medal, or any other characteristic protected by law.If you require a reasonable accommodation to apply for a position with ManTech through its online applicant system, please contact ManTech's Corporate EEO Department at (703) 218-6000. ManTech is an affirmative action\/equal opportunity employer - minorities, females, disabled and protected veterans are urged to apply. ManTech's utilization of any external recruitment or job placement agency is predicated upon its full compliance with our equal opportunity\/affirmative action policies. ManTech does not accept resumes from unsolicited recruiting firms. We pay no fees for unsolicited services.If you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access http:\/\/www.mantech.com\/careers\/Pages\/careers.aspx as a result of your disability. To request an accommodation please click careers@mantech.com and provide your name and contact information."}
{"id":246,"full_description":"Front End Developer - Clearance Desired Overview:LMI is seeking an experienced Front-End Developer to support a growing fast-paced agile project team. This position may be remote.Responsibilities:* Collaborate with designers and backend developers to implement front-end features and user interfaces.* Write clean, maintainable, and efficient code using Javascript, HTML, and CSS.* Ensure cross-browser compatibility and optimize for desktop and mobile.* Implement responsive design principles to ensure seamless user experience across various screen sizes.* Conduct thorough testing and debugging.* Participate in code reviews and provide constructive feedback to maintain code quality and best practices.* Work closely with stakeholders to understand requirements and contribute to project planning and estimation.* Create technical documentation for reference and reporting.Qualifications:**Required:*** MID LEVEL: 1-10 years relevant experience and a STEM BS degree (or equivalent experience).* Proven experience as a Front-End Developer or similar role.* Proficiency in Javascript, HTML, and CSS.* Experience with modern front-end frameworks\/libraries such as Vue, React, and\/or Angular.* Experience with responsive design techniques and cross-browser compatibility testing.* Experience with version control systems such as Git.* Experience with Agile development methodologies.* Strong problem-solving skills and attention to detail.* Excellent communication and collaboration abilities.* Ability to work effectively in a fast-paced environment and manage multiple priorities.* **Secret clearance or ability to obtain and** **maintain** **a government security clearance, for which one must be a US citizen.****Desired****:*** Agile, Lean, DevOps, Cloud, Security+ or other professional certification* Familiar with DoD IT standards and federal security standards strongly desired.* Experience with back-end technologies such as C# .NET, Java, Python, and\/or NodeJS.* Experience with Cloud infrastructure such as Amazon Web Services or equivalent.* Ability to manipulate and analyze data.* Experience working in a consultant\/client environment."}
{"id":491,"full_description":"Application release Engineer **Role:** Application Release Engineer**Location:** Remote (Three, 12 hour shifts 8am- 8pm or 8pm to 8am, with days off)**Project Description:****Technology:** Apache, Tomcat, WAS, OFSAA, OFSDF, FCCM, COMPLIANCE STUDIO, DIH, ODI, OAS, OBI, UNIX, Windows**Required Skills:**Required: 5-7 years experience in the IT Technology field Hands on experience with **Apache, Tomcat, WAS, OFSAA, OFSDF, FCCM, COMPLIANCE STUDIO, DIH, ODI, OAS, OBI, Oracle Catalogue Manager, PGX, Elasticsearch, OpenSearch** Hands on with technology more specific to Unix\/Linux as well as Windows. Strong skills of Unix command line interface during troubleshooting. Able to understand and perform snapshot backups on demand as well as recoveries during batch runs as well as batch run failures. Able to understand various clustering as well as Cross cluster replications for Production and DR environments. Able to work long hours shifts as well as efficient and comfortable working constantly in screen shared conference on daily basis. Able to handle multiple environments troubleshooting and deployment as well as configuration. Risk focused, Strong Change Management discipline and experience. Excellent communication skills (written and verbal) Proven track record of delivering results and committed to operational and service excellence. Proven working experience in a large highly regulated enterprise IT environment is a must. Strong organizational skills, with the ability to work in a fast-paced environment and manage multiple platforms, deadlines, and competing priorities. Mature and professional manner and approach, with the ability to interact with all levels within the organization. Highly developed critical thinking, analytical and problem-solving skills.Education: University Degree or a College degree\/diploma is required.Job Type: ContractPay: $46.77 - $53.32 per hourBenefits:* 401(k)* Dental insurance* Health insuranceSchedule:* 8 hour shift* Day shift* Evening shift* Night shiftExperience:* Azure: 1 year (Preferred)* Apache, Tomcat,: 1 year (Preferred)* OFSDF, , CCM: 1 year (Preferred)* FWAS, OFSAA: 1 year (Preferred)* COMPLIANCE STUDIO, DIH,: 1 year (Preferred)* UNIX, Windows: 1 year (Preferred)* , ODI, OAS, OBI,: 1 year (Preferred)Work Location: Remote"}
{"id":629,"full_description":"Software Engineer Do you have a passion for innovative ideas and groundbreaking discoveries? With over $1 billion invested annually in R&D, at Thermo Fisher Scientific youll help solve some of the worlds toughest challenges, from giving cancer patients hope, ensuring safe drinking water and helping law enforcement tackle cases through forensics. We empower our teams to put science into meaningful action and give our R&D colleagues the autonomy, resources and tools they need to take science a step beyond.**Location\/Division Specific Information**  Hillsboro, OR \/ Materials & Structural Analysis**How will you make an impact?**You will be developing automated semiconductor process equipment that delivers wafer-to-atomic information, enabling our customers to make timely decisions.**What will you do?*** Develop applications for enabling customers to automate their scanning electron microscope process workflows in a FAB environment.* Participate in designing a solution for automation of our instruments.* Collaborate across time zones with engineering leaders. Flexible with work hours.* Participate in the full software development lifecycle from inception to completion including requirements analysis, specification, design, implementation, and testing.* Add to and improve existing code to meet requirements for flexibility, new features, and maintainability.* Support customers by both reviewing specifications and providing on-site integration and validation.* Mentor junior developers so that they can improve their engineering and communication skills.**How will you get here?****Education**Bachelors degree in Computer Science, Computer Engineering, or related technical field**Experience****, Knowledge, Skills, Abilities:*** 5+ years of software development experience; strong C# skills* Proficient with Microsoft Visual Studio IDE and experience with .NET technologies (WPF\/OpenAPI).* Pride and professionalism writing readable, documented, and unit-tested code.* Excellent verbal, written, and interpersonal communication skills in order to collaborate with multifaceted cross-functional teams.* Ability to quickly come up to speed by understanding new problem domains, originating sound designs, and implementing well-structured code.* Excellent analytical and empirical problem solving and troubleshooting skills.* Ability to travel domestically and internationally**Preferred Qualifications:*** Image processing or computer vision algorithm expertise**This position has not been approved for relocation assistance.**Our Mission is to enable our customers to make the world healthier, cleaner and safer. Watch as our colleagues explain 5 reasons to work with us. As one team of 100,000+ colleagues, we share a common set of values - Integrity, Intensity, Innovation and Involvement - working together to accelerate research, solve complex scientific challenges, drive technological innovation and support patients in need. #StartYourStory at Thermo Fisher Scientific, where diverse experiences, backgrounds and perspectives are valued.Apply today!Thermo Fisher Scientific is an EEO\/Affirmative Action Employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability or any other legally protected status.Accessibility\/Disability AccessJob Seekers with a Disability: Thermo Fisher Scientific offers accessibility service for job seekers requiring accommodations in the job application process. For example, this may include individuals requiring assistance because of hearing, vision, mobility, or cognitive impairments. If you are a job seeker with a disability, or assisting a person with a disability, and require accessibility assistance or an accommodation to apply for one of our jobs, please submit a request by telephone at 1-855-471-2255*. Please include your contact information and specific details about your required accommodation to support you during the job application process.This telephone line is reserved solely for job seekers with disabilities requiring accessibility assistance or an accommodation in the job application process. Messages left for other purposes, such as not being able to get into the career website, following up on an application, or other non-disability related technical issues will not receive a response."}
{"id":238,"full_description":"Sr. Software Engineering - Android **Values & Innovation**-----------------------At Under Armour, we are committed to empowering those who strive for more, and the company's values - Act Sustainably, Celebrate the Wins, Fight on Together, Love Athletes and Stand for Equality - serve as both a roadmap for our teams and the qualities expected of every teammate.  Our Values define and unite us, the beliefs that are the red thread that connects everyone at Under Armour. Our values are rallying cries, reminding us why we're here, and fueling everything we do.  Our pursuit of better begins with innovation and with our team's mission of being the best. With us, you get the freedom to go further - no matter your role. That means developing, delivering, and selling the state-of-the-art products and digital tools that make top performers even better.  If you are a current Under Armour teammate, apply to this position on the **Internal Career Site Here.****Purpose of Role**-------------------At Under Armour we are rethinking how e-commerce should be done and we want great engineers to help us create our next generation mobile apps. Taking advantage of cutting-edge technology, we are assembling a modular, maintainable and performant mobile platform that leverages automation to give engineers a good balance of freedom, insight and accountability.Were a team of passionate engineers who love bringing innovative mobile experiences to our end users. We are growing and want you to become part of what is, and will continue to be, a challenging and exciting environment. We are looking for people whose idea of a good time is helping us bring our big ideas to life in the cleanest and most reliable way. Were looking for people who understand that they never stop learning and are excited by that. Were looking for people who rejoice in elegant solutions to complex problems.**Your Impact**---------------* Execute full lifecycle software development for the Under Armour Android app.* Participate and architect extensible solutions in Kotlin.* Write well designed, testable, efficient code; document and maintain software functionality.* Work closely with backend engineers to design and optimize client\/server interaction model.* Provide thoughtful leadership on industry best practices around design, testing, and security.* Work closely with product teams to define and refine feature specifications.* Lead integration discussions with internal and external partners.**Qualifications**------------------* High proficiency in Kotlin and deep understanding of the Android platform* Familiarity with complex layout design* Experience with Android libraries such as Dagger, OkHttp\/Retrofit, RxJava and JUnit* Experience writing unit tests and testable code.* High proficiency with using Git in a team environment.* Experience working closely with product and design teams to break business requirements down into actionable engineering tasks.* Comfortable working with RESTful or GraphQL APIs* Experience with GraphQL* Experience with DataDog, NewRelic, or other APM technologies* Experience with SalesForce Commerce Cloud**Workplace Location**----------------------* **Location:** Fully Remote**Relocation**--------------* No relocation provided**Base Compensation**--------------------- $123,747.00 - $170,152.40 USDMost new hires fall within this range and have the opportunity to earn more over time. Initial placement within the salary range, however, is based on an individual's relevant knowledge, skills and experience for the position. UA is committed to helping our teammates succeed and advance in their careers. Base salary is only one component of our competitive Total Rewards package.**Benefits & Perks**--------------------  * Paid \"UA Give Back\" Volunteer Days: Work alongside your team to support initiatives in your local community.* Under Armour Merchandise Discounts* Competitive 401(k) plan matching.* Maternity and Parental Leave for eligible and FMLA-eligible teammates* Health & fitness benefits, discounts and resources- We offer teammates across the country programs to promote physical activity and overall well-being.  Want more details about benefits? Visit our page **here****Our Commitment to Diversity**-------------------------------At Under Armour, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion or belief, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, family or paternal status and any other characteristic protected by applicable law. Under Armour believes that diversity and inclusion among our teammates is critical to our success as a global company, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. Accommodation is available for applicants with disabilities upon request."}
{"id":459,"full_description":"Dynamics 365 F&SCM Functional Solution Architect **Job Summary:**BDO Digital, LLC., a wholly owned subsidiary of BDO USA, P.C., is a rapidly growing digital advisory organization dedicated to helping middle-market organizations capture the full power of technology, adapt to disruption, increase operational efficiencies, improve risk management effectiveness, and uncover new sources of revenue. Our collaborative, cross-disciplinary team is comprised of digital strategists, systems integrators, data scientists, software developers, change management professionals, and industry-specific advisors who work together to solve clients immediate digital needs and unearth new opportunities to drive competitive advantage. Our goal is to help our clients become faster, smarter, and more resilient to change.To support our double-digit growth goals, BDO Digital seeks a manager who will be part of an Enterprise Business Applications (EBA) team supporting projects in the areas of EBA strategy and implementation, in addition to Business Transformation and Operational Excellence efforts. This role will conduct discovery, requirements gathering, process documentation, configuration, and implementation management of ERP (Enterprise Resource Planning), CRM (Customer Relationship Management), HCM (Human Capital Management) and other related business applications functioning as a key resource for our clients spanning, finance, product distribution, manufacturing, job costing, field service, sales, marketing, service, and reporting.    **Job Duties:*** Strategy, Requirements & Selection:+ Participates in defining needs for existing and new EBA solutions+ Documents existing enterprise business applications, related business processes, and personas impacted+ Identifies existing inefficiencies, potential improvement opportunities, and critical differentiating business requirements+ Envisions and develops representations of recommended future state options for evaluation by clients+ Understands related security structures and best practices+ Designs and develops scorecards for evaluation of candidate business applications+ Creates dashboard presentations of quantitative and qualitative scoring of candidate options+ Supports Technical Leads, Developers and Managers by providing functional clarifications and setting expectations with team and client* Solution Functional Design:+ Performs functional (business process) solution design in business applications (ERP, HCM, CRM, & related) contexts, to provide maximized business value and deliver strong business agility while meeting applicable requirements and constraints* Consulting:+ Gains a deep understanding of client needs, analyzes best practices, and plays an integral part in defining and proposing business value solutions that meet or exceed client expectations* Program & Project Management:+ Supports, and manages aspects of business applications implementations+ Documents and maintains project milestones, phases, elements, and budget+ Monitors project progress by tracking risks, actions, issues, decisions, and other activities+ Develops references for users by writing and maintaining user documentation; providing help desk support; training users* Implementation and Support:+ Provides functional support of EBA solutions and related technologies+ Manages and resolves issues, defects, and change requests+ Manages and performs systems configuration tasks (but not coding\/development) for process workstreams as directed+ Provides ongoing support during project implementations and post-go-live support+ Responsible for configuration of solution based on requirements* Fosters a positive demeanor, learning attitude and client service mentality with the team* Travel – up to 25%, as needed* Other duties, as required**Supervisory Responsibilities:*** Owns and drives completion of key workstreams as directed by project leaders* Manages project workstreams as directedMentors and develops entry level consultants and senior consultants  *   **Qualifications, Knowledge, Skills and Abilities:****Education:*** Bachelors Degree and six (6) or more years of industry experience with ERP systems, required; OR* High School Diploma\/GED and seven (7) or more years of industry experience with ERP systems, required**Experience:*** Six (6) or more years of business process analysis and\/or business application education or experience, required* Four (4) or more years of education or experience with ERP or CRM Product, required* Some client facing best practice consulting experience, preferred**License\/Certifications:*** One or more current business applications technology certifications, preferred**Software:*** Microsoft Visio, PowerPoint, Word, and SharePoint, required* Experience with one or more ERP\/CRM\/HCM Solutions technology, required:+ Microsoft Dynamics 365 (D365), CRM, Business Central, F&SCM), Ceridian Dayforce Solutions (Talent & Benefits Intelligence, Workforce Management (WFM), HR, Advanced HR Analytics, or Payroll), Salesforce, Oracle NetSuite, Acumatica, SAP, Infor, Sage, Syteline, JDE, IFS, or any other ERP\/CRM Software* Smartsheet, preferred* Enterprise software strategy, selection, and implementation experience, preferred**Other Knowledge, Skills & Abilities:*** Strong analytical, problem solving, facilitation, documentation, and communication skills* Excellent communication and presentation skills, both verbal and written* Excellent interpersonal and customer relationship skills* Business process analysis, design, and process flow skills* Excels at operating in a fast-paced technical environment**Keywords:**  Salesforce, Sales Cloud, Service Cloud, Marketing Cloud, Business Central, Microsoft Dynamics Business Central, Microsoft Dynamics Finance & Operations, Dynamics F&O, Microsoft Finance and Supply Chain Management, Microsoft F&SCM, Microsoft Dynamics 365, Dynamics 365 CRM, Microsoft Customer Experience Platform, Business Analyst, BA, Enterprise Tester, Requirements Gathering, User Experience, User Enablement, Data Visualization, Software, Definition, Custom Applications, Data Analytics, Cloud Strategy, SharePoint, Office 365, O365, SFDC, D365, Acumatica, NetSuite. OpenAir, Ceridian Dayforce, HCM, Human Capital Management    Individual salaries that are offered to a candidate are determined after consideration of numerous factors including but not limited to the candidates qualifications, experience, skills, and geography.California Range: $125,000 - $162,000  Colorado Range: $125,000 - $162,000  New York City\/ Valhalla Range: $125,000 - $162,000  Washington Range: $125,000 - $162,000  BDO delivers assurance, tax, digital technology solutions and financial advisory services to clients throughout the country and around the globe. We offer numerous industry-specific practices, world-class resources, and an unparalleled commitment to meeting our clients needs. We currently serve more than 400 publicly traded domestic and international clients.* Unparalleled partner-involvement* Deep industry knowledge and participation* Geographic coverage across the U.S.* Cohesive global network* Focused capabilities across disciplinesBDO brings world-class resources and exceptional service to each and every one of our clients. BDO USA is a member of BDO International, the worlds fifth largest accounting network.    BDO offers a competitive Total Rewards package that encompass so much more than – “traditional benefits”. Our wide range of rewards and our employees ability to customize rewards to their individual needs are two of the reasons why BDO has been honored with so many workplace awards, including 100 Best Companies for Working Parents, Working Mother 100 Best Companies, Top Entry Level Employer, 2022 National Best & Brightest Companies to Work For and more.Some examples of our Total Rewards offerings include:* Competitive pay and eligibility for an annual performance bonus.* A 401k plan plus an employer match* Comprehensive, medical, dental, vision, FSA, and prescription insurance from day one* Competitive Paid Time Off with daily accrual from day one of employment, plus paid holidays* Paid Parental Leave* Adoption Assistance* Firm paid life insurance* Wellness programs* Additional offerings include BDO Flex, Group Legal insurance, Pet insurance and Long-Term Care InsuranceAbove offerings may be subject to eligibility requirements.Click here to find out more!"}
{"id":661,"full_description":"Software Engineer II **7-Eleven is Hiring Immediately: Software Engineer II - Full Stack**We are looking for a great JavaScript developer who is proficient with latestJavascript (ECMA-Script) standards, NodeJS. Your primary focus will be ondeveloping sophisticated, scalable middleware platform using RESTful \/Serverless API's to be consumed across 7-Eleven. You will ensure that theplatform is robust and easy to maintain. You will coordinate with the rest ofthe team working on different layers of the infrastructure. Therefore, acommitment to collaborative problem solving, sophisticated design, and qualityproduct is important. **Our benefits include:**          * 401k plan          * Coverage in medical, dental, life, and vision insurances available          * Paid PTO Plans          * Paid holidays          * Tuition Reimbursement and Adoption Assistance **Skills & Responsibilities**          * Expertise in ReactJS and Node.JS development          * Expertise in UI development using ReactJS, have expertise in HTML5\/CSS3 and Responsive web development with PWA experience.          * Familiarity with latest ECMA-Script specifications.          * Expertise in AWS technologies like CloudFront, SNS, SES, SQS, Cloud Formation          * Expertise in working with DevOps and Build pipelines.          * Expertise in development of Unit Test cases and Testing frameworks and scripting          * Expertise in client-side JavaScript framework like React, jQuery          * Experience in JavaScript and supporting technologies such as TypeScript and NPM          * Experience in building solutions on top of AWS such as Lambda, API Gateway, ECS, S3 and others          * Strong Experience in building Node.JS concepts (Such as event loop, cluster, memory management)          * Experience working with enterprise technology platforms. Possess a strong technical background          * Strong experience of building RESTful web services          * Strong knowledge in NoSQL databases. MongoDB is a plus.          * Strong experience with development methodologies such as XP, Agile or SCRUM          * Exposure to a wide range of technologies including enterprise application integration, database design and configuration, web applications, operating platforms, security and networking.          * Develop unit tests during the development process.          * Ability to drive design\/architectural path          * Demonstrate strong problem-solving ability and analytical skills **Qualifications:**          * Strong communication, presentation, and advisory skills          * 5-7 years development experience          * 5+ years of ReactJS experience.          * 5+ years Node.JS experience          * 5+ years JavaScript experience. **7-Eleven, Inc is an Equal Opportunity Employer and is committed toworkplace diversity.**Job Type: Full-timeBenefits:          * 401(k) matching          * Dental insurance          * Health insurance          * Life insurance          * Paid time off          * Tuition reimbursement          * Vision insuranceWork Location: In person"}
{"id":171,"full_description":"Structural Engineer | Bridges We are seeking a motivated and enthusiastic Structural Engineer | Bridges to join our growing team at VN Engineers, Inc. The ideal candidate will lead the analysis, design, and contract document development for major transportation structures.Key Responsibilities:* Conduct detailed structural analysis and design calculations* Prepare plans, specifications, and cost estimates for projects* Manage project budgets and schedules* Mentor and supervise the work of junior engineers and technicians* Provide on-site inspection and construction management services* Stay up to date with the latest bridge engineering technologies and design methodologiesQualifications:* Bachelor's degree in Civil Engineering or related field required, Master of Science with a focus in Structural Engineering preferred* Minimum of 5 years of experience in bridge engineering* Progressive experience in design and construction of bridges* Experience in the development of demolition plans and specifications is a plus* Strong knowledge of AASHTO, AREMA, State Design Manuals and Standards* Experience using industry-standard software such as MicroStation v8i, OpenBridge, AutoCAD, STAAD, LARSA 4D, Midas, MDX, AASHTOWare* Strong technical writing and communication skills* NY PE license is required* Experience working on Design Build projects is a plus but not required* Experience working with the MTA, PANYNJ, NYSDOT, or NYCDOT is a plus but not required* Passion for the field of structural engineeringWe offer a competitive salary and benefits package, as well as opportunities for professional development and advancement. If you are a self-motivated individual with a strong work ethic and a desire to succeed, we want to hear from you!This is a full-time position with benefits including: Health Insurance, Dental Insurance, Matching Retirement Plan, Paid Time Off (Vacation, Sick, Personal, Holidays), Short-Term and Long-Term Disability and Life Insurance, Flexible Scheduling.VN Engineers, Inc. is a multi-disciplined civil engineering consulting firm which specializes in infrastructure, transportation, traffic, highway, construction inspection, planning, structural design and water resources fields. For over 40 years, VN Engineers, Inc. has played a significant role in the planning and design of major engineering projects in seven states and two countries. VN Engineers, Inc. works for government agencies and the private sector in the capacity of both a Prime and Subconsultant.VN Engineers, Inc. is an Affirmative Action\/Equal Opportunity Employer. All qualified applicants will receive consideration for employment without unlawful discrimination based on race, color, creed, national origin, sex, age, disability, marital status, sexual orientation or citizenship status, and that it is an equal employment opportunity employer. Salary based on level of experience.Job Type: Full-timePay: From $115,000.00 per yearBenefits:* 401(k)* 401(k) matching* Dental insurance* Health insurance* Health savings account* Life insurance* Paid time off* Retirement planSchedule:* 8 hour shift* Monday to FridayAbility to Relocate:* North Haven, CT 06473: Relocate before starting work (Required)Work Location: Hybrid remote in North Haven, CT 06473"}
{"id":267,"full_description":"Training and Development Manager Overview:**Training and Development Manager** **US Remote**  The Emmes Company, LLC (“Emmes”) is a global, full-service Clinical Research Organization dedicated to excellence in supporting the advancement of public health and biopharmaceutical innovation. We believe in the power of truth, so much so that we named our company Emmes, which means truth. Through decades of experience we have learned that collaborative relationships thrive and human health benefits when truth is our compass.  Our “Character Achieves Results” culture is driven by five key values that guide our actions in the way we conduct research and distinguish us as an organization: Integrity, Agility, Passion for Excellence, Collaborative Partnerships and Intellectual Curiosity. We are a trusted partner to clients who share our passion for improving public health in a world of ever-changing scientific research.  If you share our motivations and passion in research, come join us! You will be joining a collaborative culture that empowers every Emmes employee — from entry level through top executive — to contribute to our clients success by sharing ideas openly and honestly. **Primary Purpose**The Training and Development Manager is a critical role responsible for defining and managing curriculums aligned with skill gaps, regulatory requirements and defined needs aligned with designated customer groups. Specific responsibilities include curriculum planning and management, stakeholder and SME relationship management, instructional design planning and management and related logistical activities associated with implementing curriculum plans.Responsibilities:* Establishes and manages internal stakeholder relationships with designated customer groups as related to training* Identifies and diagnoses training needs and gaps for designated customer groups* Develops and implements curriculum plans aligned with gaps for a designated customer groups that address needs, regulations and resource capacities* Scopes learning solutions aligned with validated training needs and gaps in collaboration with SMEs* Drives and manages the development of learning solutions in collaboration with SMEs and instructional designers\/eLearning developers for either eLearning or instructor-led delivery in order to implement curriculum plans* Manage vendor and contractor resources engaged to design and\/or deliver training* Manages virtual classroom accounts* Creates, enters, and updates training schedules in the learning management system* Develops and manages a schedule of live learning solution deliveries aligned with hiring cadences, business needs and global audiences* Trains, schedules, manages and supports an instructor pool* Manages training materials including access for both instructors and participants* Manages training delivery quality by establishing and maintaining instructional delivery standards* Leads the identification, deployment, and promotion of the most effective curriculum management practices across the department* Manages training materials quality by establishing and maintaining content and training product standards Leads evaluation efforts as a means of determining training impact and areas for improvement including the development and management of all levels of the Kirkpatrick Four Levels of Evaluation* Other duties as assignedQualifications:* Bachelors degree in a learning and development field; masters degree preferred* Minimum 5 years relevant experience developing and managing training programs in a global, highly regulated environment, preferably global health, clinical research, biotechnology or life sciences* Experience and formal training in instructional design and adult learning* Experience developing and maintaining training evaluation practices with the Kirkpatrick Four Levels of Evaluation* Experience working in a global environment Strong stakeholder relationship skills* Strong background in planning and managing instructional design and eLearning development projects* Strong training vendor\/contractor management capabilities* Excellent training diagnostic skills* Excellent computer skills with various software applications including Office 365 products, Word, Excel, and PowerPoint to produce training materials* Strong written and oral communication skills* Ability to solve problems with many variables and offer various options for resolution* Ability to organize and prioritize personal tasks to meet deadlines and service level objectives **Emmes requires all US based Clinical Research Associate new hires to be fully vaccinated before their first day of employment. All new hires may also be required to comply with other COVID-19 health and safety protocols, such as masking or testing.** **Emmes complies with all applicable laws regarding reasonable accommodations or exemptions for religious, medical, or other legally protected reasons.** *Why work at Emmes?*  At Emmes, your actions and hard work will have a direct impact on public health initiatives, both globally and in our local communities with opportunities for volunteerism through our **Emmes Cares** community engagement program. We offer a competitive benefits package focused on the health and needs of our growing workforce, including:* **Flexible Approved Time Off*** **Tuition Reimbursement*** **401k Retirement Plan*** **Work From Home Anywhere in the US*** **Maternal\/Paternal Leave*** **Casual Dress Code & Work Environment** **CONNECT WITH US!***Follow us on Twitter - @EmmesCRO**Find us on LinkedIn - The Emmes Company, LLC* *The Emmes Company, LLC is an equal opportunity affirmative action employer and does not discriminate in its selection and employment practices. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, political affiliation, sexual orientation, gender identity, marital status, disability, protected veteran status, genetic information, age, or other legally protected characteristics.*"}
{"id":554,"full_description":"Sr. Backend Software Enigneer Sr. Backend Software Enigneer**Location:** Remote or San Francisco**Salary:** $150k - $190kWe develop predictive battery management software with big deployments for energy and transportation industries. Our clients manage battery systems worth over $100 million in renewable energy storage projects, EVs, and satellites.Together with lab test engineers, battery algorithms engineers, and machine learning engineers, you will collaborate closely to develop robust, adaptable, and user-friendly solutions that significantly boost the volume and speed at which we can gather data and develop state-of-the-art battery models.* Create internal API tooling and infrastructure to make our battery data available to our web application, and make sure our APIs are efficient, dependable, and safe.* Work with cross-functional teams to develop and put into practice scalable solutions that handle large, highly structured data sets with needs unique to your area.* Provide tools and resources that battery algorithm engineers and data scientists can use to develop, hone, and implement battery models throughout our systems.* Tutor and advise the team's younger engineers in technical matters.**Qualifications:*** Five years of experience developing Python apps for distributed, large-scale systems* Strong command of SQL, database design, and data modeling* Knowledge of the whole software development life cycle, including design, implementation, testing, and deployment*Preferred Additional qualifications:** Familiarity with data platforms and machine learning systems and technologies* Cloud-based technologies such as AWS, Azure, or GCP* Docker or Kubernetes**Benefits*** Competitive salary and equity* Health, Dental, and Vision care for you and your family* 401K savings plan* Unlimited vacation policy  Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Ryan Hassell  Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Ryan Hassell  Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Ryan Hassell -Applicants must be authorized to work in the U.S. **CyberCoders is proud to be an Equal Opportunity Employer**    All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law.    **Your Right to Work** – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire."}
{"id":332,"full_description":"Senior Principal Product Manager, Oracle Cloud Financials - Core Accounting Join our Core Accounting Product Management team within Oracle Cloud ERP and embark on a journey to shape the next generation of finance functions, focused around the Record to Report process. This opportunity will place you at the heart of our mission to redefine and enhance the way businesses manage their financials, from transaction capture through to the period-end close. In this role, you will contribute to optimizing accounting practices, simplifying the period-end close, driving innovation in financial reporting and compliance, and improving the overall financial health of our customers' businesses. By collaborating closely with application developers, quality assurance teams, release management, and support teams throughout the product lifecycle, you will ensure the delivery of high-quality, innovative solutions that make financial reporting seamless and more efficient.  Responsibilities for the role include:* Lead a discussion with the management to gain insight into the product roadmap and project assigned - its background, goal and scope. Ensure management expectations & delivery timelines are clearly understood.* Liaison between Strategy\/Customer\/Management to understand customer business processes and get a complete 360 analysis of the related requirements.* Formulate how the product roadmap will help acquire new customers\/market penetration by recording value proposition.* Be creative in designing solutions for customer problems\/requirements.* Produce high quality design document with comprehensive and detailed solution analysis with a focus on all core areas: extensibility, robustness, backward compatibility, supportability, exception handling, performance expectations\/bench-marking, upgrade plan for customers, critical technology or product dependencies, product resiliency (self-correction) and flexibility (user self-service feature), cloud operational considerations: recover and restart ability, opt-in options for the customer. Design should include the definition of product use cases, wireframes and upstream and downstream impact areas* Uphold product quality to the highest standards. As part of design it is very critical to document testing strategy that identifies the success\/acceptance criteria for the project. Ensure that any test-ware is in line with focus of the enhancement, is tested with real customer use cases\/data patterns and influences.* Ensure the MVP definition is aligned with customer commitment in mind, and management sign off is received.* Collaborate with Developers on reviewing any technical solution document to ensure that it is aligned with the finalized solution approach* Work closely with Technical Writers to create launch deliverables like New Feature Summary, Whats New and TOI's* You will be a financial functional expert capable of establishing relationships with many highly technical teams. You will be able to understand current and future technology and to identify opportunities for its use to benefit customers through discussions with developers.**Requirements:****Preferred Qualifications:*** Bachelor's degree (or Post Graduate\/Doctorate) in Finance and Accounting or Economics or Computer Science.* Major(s): Any of these or related: Computer Science\/Engineering, Software Systems, Management and Engineering, Information and Data Management, Artificial Intelligence, Business Management, Business Finance.* Financial educational background is very much desirable. The successful applicant should have in-depth understanding of financial flows and business processes involved in finance management.* Experience in SaaS Enterprise Resource Planning product management, consulting, or finance operations.**Other qualifications:*** Experience in SaaS Enterprise Performance Management.* Strong analytical skills, strong written and verbal communication skills.* Ability to thrive in fast paced environment and learn quickly.* Desire to work in a cross-functional, co-located team environment.* Demonstrate an excellent understanding of standard word processing, spreadsheet and presentation applications.* Experience of working in an Agile environment with a strong understanding of the Scrum framework and principles. Ability to train\/coach\/adopt teams to adopt continuous delivery practices and lean\/agile methodologies.* Experience in developing cloud products with strong understanding of Cloud native application patterns, CI\/CD, DevOps.* Experience in using Data analysis to derive product and business insights for driving product design and strategy.* Experience in designing modern customer experience with exposure to Information architecture, Interaction design, user persona identification and modelling etc.* Experience in digital customer experience, digital product management."}
